local function TiiGeRTeaM(msg, mr_roo)
local StartPm = {"↫ ","⇜ ","⌯ ","℘ ","↜ ","⇋ "}
local M_START = StartPm[math.random(#StartPm)]
--######################################################################--
if msg.cb then
if mr_roo[1] == '/helplist' then
	if not is_mod1(mr_roo[2], msg.from.id) then
     Canswer(msg.cb_id, "شما مدیر نیستید \nبرای خرید ربات به پیوی :\n "..sudo_username.."\nیا به کانال زیر مراجعه کنید :\n "..channel_username.."" ,true)
   elseif not is_req(mr_roo[2], msg.from.id) then 
    Canswer(msg.cb_id, "شما این فهرست را درخواست نکردید" ,true)
	else
		helplist(msg, mr_roo[2])
	end
end
if mr_roo[1] == '/helplist2' then
	if not is_mod1(mr_roo[2], msg.from.id) then
     Canswer(msg.cb_id, "شما مدیر نیستید \nبرای خرید ربات به پیوی :\n "..sudo_username.."\nیا به کانال زیر مراجعه کنید :\n "..channel_username.."" ,true)
   elseif not is_req(mr_roo[2], msg.from.id) then 
    Canswer(msg.cb_id, "شما این فهرست را درخواست نکردید" ,true)
	else
		helplist2(msg, mr_roo[2])
	end
end
--######################################################################--
if mr_roo[1] == '/helplock' then
	if not is_mod1(mr_roo[2], msg.from.id) then
     Canswer(msg.cb_id, "شما مدیر نیستید \nبرای خرید ربات به پیوی :\n "..sudo_username.."\nیا به کانال زیر مراجعه کنید :\n "..channel_username.."" ,true)
   elseif not is_req(mr_roo[2], msg.from.id) then 
    Canswer(msg.cb_id, "شما این فهرست را درخواست نکردید" ,true)
	else
		lockhelp(msg, mr_roo[2])
	end
end
--######################################################################--
if mr_roo[1] == '/helppanelsudo' then
	if not is_mod1(mr_roo[2], msg.from.id) then
     Canswer(msg.cb_id, "شما مدیر نیستید \nبرای خرید ربات به پیوی :\n "..sudo_username.."\nیا به کانال زیر مراجعه کنید :\n "..channel_username.."" ,true)
   elseif not is_req(mr_roo[2], msg.from.id) then 
    Canswer(msg.cb_id, "شما این فهرست را درخواست نکردید" ,true)
	else
		sudopanel(msg, mr_roo[2])
	end
end
--######################################################################--
if mr_roo[1] == '/infosudo1' then
	if not is_mod1(mr_roo[2], msg.from.id) then
     Canswer(msg.cb_id, "شما ادمین ربات نیستید \nبرای خرید سورس به پیوی :\n @Arashw\nیا به کانال زیر مراجعه کنید :\n @TiiGeRTeaM",true)
   elseif not is_req(mr_roo[2], msg.from.id) then 
        Canswer(msg.cb_id, "شما این فهرست را درخواست نکردید" ,true) 
	else
	local text = "`اطلاعات مربوط به سودوی اصلی :`\n\n*توکن فعلی ربات :* "..check_markdown(bot_token).."\n*یوزنیم کانال خریدار :* "..check_markdown(channel_username).."\n*یوزنیم خریدار :* "..check_markdown(sudo_username).."\n*آیدی کانال realm :* "..gp_sudo.."\n*آیدی سودو اصلی :* "..SUDO.."\n*آیدی ربات cli :* "..BotTiGeR_id.."\n*آیدی ربات api :* "..BotTiGeR_idapi..""
	keyboard = {} 
	keyboard.inline_keyboard = {
		{
			{text= '⇜ بازگشت' ,callback_data = '/helppanelsudo:'..mr_roo[2]}
		}
	}
	edit_inline(msg.message_id, text, keyboard)
	end
end
--######################################################################--
if mr_roo[1] == '/sudolist1' then
	if not is_mod1(mr_roo[2], msg.from.id) then
     get_alert(msg.cb_id, "شما ادمین ربات نیستید \nبرای خرید سورس به پیوی :\n @Aarshwm\nیا به کانال زیر مراجعه کنید :\n @TiiGeRTeaM")
   elseif not is_req(mr_roo[2], msg.from.id) then 
        Canswer(msg.cb_id, "شما این فهرست را درخواست نکردید" ,true) 
	else
	local sudo_users = _config.sudo_users
	text = "℘ _لیست سودو های ربات :_\n"
	for i=1,#sudo_users do
    text = text..i.." - "..sudo_users[i].."\n"
	end
	text = text.."\n`₪ برای مشاهده میتوانید از دستور زیر استفاده کنید`\n*Res* "..Arashwm..""
	keyboard = {} 
	keyboard.inline_keyboard = {
		{
			{text= '⇜ بازگشت' ,callback_data = '/helppanelsudo:'..mr_roo[2]}
		}
	}
	edit_inline(msg.message_id, text, keyboard)
	end
end
--######################################################################--
if mr_roo[1] == '/markread' then
	if not is_mod1(mr_roo[2], msg.from.id) then
     Canswer(msg.cb_id, "شما مدیر نیستید \nبرای خرید ربات به پیوی :\n "..sudo_username.."\nیا به کانال زیر مراجعه کنید :\n "..channel_username.."" ,true)
   elseif not is_req(mr_roo[2], msg.from.id) then 
    Canswer(msg.cb_id, "شما این فهرست را درخواست نکردید" ,true)
	else
		local chklock = redis:get(RedisIndex..'markread')
		if chklock then
			text = 'تیک دوم خاموش شد'
			redis:del(RedisIndex..'markread')
		else
			text = 'تیک دوم روشن شد'
			redis:set(RedisIndex..'markread','on')
		end
		get_alert(msg.cb_id, text)
		sudopanel(msg, mr_roo[2])
	end
end
--######################################################################--
if mr_roo[1] == '/autoleave' then
	if not is_mod1(mr_roo[2], msg.from.id) then
     Canswer(msg.cb_id, "شما مدیر نیستید \nبرای خرید ربات به پیوی :\n "..sudo_username.."\nیا به کانال زیر مراجعه کنید :\n "..channel_username.."" ,true)
   elseif not is_req(mr_roo[2], msg.from.id) then 
    Canswer(msg.cb_id, "شما این فهرست را درخواست نکردید" ,true)
	else
		local chklock = redis:get(RedisIndex..'auto_leave_bot')
		if chklock then
			text = 'خروج خودکار فعال شد'
			redis:del(RedisIndex..'auto_leave_bot')
		else
			text = 'خروج خودکار غیرفعال شد'
			redis:set(RedisIndex..'auto_leave_bot', true)
		end
		get_alert(msg.cb_id, text)
		sudopanel(msg, mr_roo[2])
	end
end
--######################################################################--
if mr_roo[1] == '/helpsudo1' then
	if not is_mod1(mr_roo[2], msg.from.id) then
     Canswer(msg.cb_id, "شما ادمین ربات نیستید \nبرای خرید سورس به پیوی :\n @Arashwm\nیا به کانال زیر مراجعه کنید :\n @TiiGeRTeaM",true)
   elseif not is_req(mr_roo[2], msg.from.id) then 
        Canswer(msg.cb_id, "شما این فهرست را درخواست نکردید" ,true) 
	else
	local text = [[
	╰☆╮ راهنمای سودوی ربات: ╰☆╮

✬ برای نصب ربات در گروه:
↫ `نصب گروه`
●•۰ `add`
✦ این دستور برای نصب کردن ربات در گروهی جدید میباشد.

✬  برای تنظیم تاریخ انقضای گروه:
↫ `شارژ` 1-1000
●•۰ `charge` 1-1000
✦ این دستور برای تنظیم مدت فعالیت ربات در گروه میباشد.

✬  برای تنظیم انقضای نامحدود گروه:
↫ `نامحدود`
●•۰ `full`
✦ این دستور برای تنظیم نامحدود بودن فعالیت ربات در گروه میباشد.

✬ برای تنظیم کرد فرد به عنوان سودوی ربات:
↫ `تنظیم سودو` یوزرنیم | ایدی | ریپلای
●•۰ `setsudo` username | id | reply
✦ این دستور برای تنظیم کردن شخصی به عنوان سودوی ربات میباشد.

✬ برای حذف کرد فرد از عنوان سودوی ربات:
↫ `حذف سودو` یوزرنیم | ایدی | ریپلای
●•۰ `remsudo` username | id | reply
✦ این دستور برای حذف کردن شخصی از عنوان سودوی ربات میباشد.

✬ برای تنظیم کرد فرد به عنوان ادمین ربات:
↫ `تنظیم ادمین` یوزرنیم | ایدی | ریپلای
●•۰ `setadmin` username | id | reply
✦ این دستور برای تنظیم کردن شخصی به عنوان ادمین ربات میباشد.

✬ برای حذف کرد فرد از عنوان ادمین ربات:
↫ `حذف ادمین` یوزرنیم | ایدی | ریپلای
●•۰ `remadmin` username | id | reply
✦ این دستور برای حذف کردن شخصی از عنوان ادمین ربات میباشد.

✬  برای ارتقا صاحب گروه و مدیران گروه در ربات:
↫ `پیکربندی`
●•۰ `config`
✦ این دستور برای تنظیم مالک گروه و مدیران گروه در ربات به صورت خودکار میباشد.

✬  برای دریافت شناسه گروه:
↫ `آیدی گروه`
●•۰ `gid`
✦ این دستور برای دریافت شناسه عددی گروه توسط ربات میباشد.

✬  برای نمایش زمان باقی مانده از انقضای ربات:
↫ `اعتبار`
●•۰ `expire`
✦ این دستور برای دریافت زمان دقیق باقی مانده از مئت فعالیت ربات در گروه میباشد.

✬ برای حذف ربات از لیست مدیریتی:
↫ `حذف گروه`
●•۰ `rem`
✦ این دستور برای حذف کردن ربات نصب شده در گروه میباشد.

✬ برای خارج کردن ربات از گروه:
↫ `خروج`
●•۰ `leave`
✦ این دستور برای خارج کردن ربات از گروه توسط سودو و ادمین میباشد.

✬ برای ورود ربات توسط لینک:
↫ `ورود لینک` لینک گروه
●•۰ `import` GLink
✦ این دستور برای ورود ربات به گروه مورد نظر توسز لینک میباشد.

✬ برای دعوت دادن سودوی اصلی ربات به گروه:
↫ `ورود به` ایدی گروه
●•۰ `jointo` Gid
✦ این دستور برای دعوت دادن صاحب ربات به گروه میباشد.

✬ برای نمایش سودو های ربات:
↫ `لیست سودو`
●•۰ `sudolist`
✦ این دستور برای نمایش دادن اشخاص دارای مقام سودوی در ربات میباشد.

✬ برای نمایش ادمین های ربات:
↫ `لیست ادمین`
●•۰ `adminlist`
✦ این دستور برای نمایش دادن اشخاص دارای مقام ادمینی در ربات میباشد.

✬ برای ساخت گروه توسط ربات:
↫ `ساخت گروه` اسم مورنظر
●•۰ `creategroup` Name
✦ این دستور برای ساخت گروه توسط ربات میباشد.

✬ برای ساخت سوپرگروه توسط ربات:
↫ `ساخت سوپرگروه` اسم مورنظر
●•۰ `createsuper` Name
✦ این دستور برای ساخت سوپرگروه توسط ربات میباشد.

✬ برای تبدیل گروه ساخته شده توسط ربات به سوپرگروه:
↫ `تبدیل به سوپرگروه`
●•۰ `tosuper`
✦ این دستور برای تبدیل گروه معمولی ساخته شده توسط ربات به سوپرگروه میباشد.

✬ برای ارسال متن به یک گروه توسط ربات:
↫ `ارسال` متن ایدی گروه
●•۰ `bc` text gid
✦ این دستور برای ارسال پیام متنی به یک گروه خاص توسط ربات میباشد.

✬ برای ارسال متن به همه گروهای ربات:
↫ `ارسال به همه` متن
●•۰ `broadcast` text
✦ این دستور برای ارسال پیام متنی به همه گروهای مدیریتی ربات میباشد.

✬ برای نمایش گروه های ربات:
↫ `لیست گروه ها`
●•۰ `chats`
✦ این دستور برای نمایش دادن لیست گروه های مدیریتی ربات میباشد.

✬ برای فعال و غیرفعال کردن خروج خودکار ربات:
↫ `خروج خودکار` `فعال`|`غیرفعال`
●•۰ `autoleave` `enable`|`disable`
✦ این دستور برای فعال و غیر فعال کردن خروج خودکار ربات میباشد.

✬ برای تغییر نام ربات:
↫ `تغییر نام ربات` نام جدید
●•۰ `setbotname` New name
✦ این دستور برای تغییر نام ربات میباشد.

✬ برای تغییر یوزرنیم ربات:
↫ `تغییر یوزرنیم ربات` یوزرنیم جدید
●•۰ `setbotusername` new Username
✦ این دستور برای تغییر یوزرنیم ربات میباشد.

✬ برای حذف یوزرنیم ربات:
↫ `حذف یوزرنیم ربات`
●•۰ `delbotusername`
✦ این دستور برای حذف یوزرنیم ربات میباشد.

✬ برای فعال و غیرفعال کردن خواندن پیام ربات:
↫ `تیک دوم` `فعال`|`غیرفعال`
●•۰ `markread` `enable`|`disable`
✦ این دستور برای فعال و غیر فعال کردن خواندن پیام های دریافتی ربات میباشد.

✬ برای باز کردن پنل گروه مشتریا ربات:
↫ `پنل گروه` [ایدی]
●•۰ `panelgp` [id gp]
✦ این دستور برای باز کردن پنل گروه مشتریا ربات میباشد.

✬ برای ساخت کدهدیه:
↫ `کدهدیه`
●•۰ `codegift`
✦ این دستور برای ساخت کدهدیه میباشد.

✬ برای دریافت لیست کدهدیه:
↫ `لیست کدهدیه`
●•۰ `giftlist`
✦ این دستور برای دریافت لیست کدهدیه میباشد.
	]]
	keyboard = {} 
	keyboard.inline_keyboard = {
		{
			{text= '⇜ بازگشت' ,callback_data = '/helppanelsudo:'..mr_roo[2]}
		}
	}
	edit_inline(msg.message_id, text, keyboard)
	end
end
--######################################################################--
if mr_roo[1] == '/helpmah' then
	if not is_mod1(mr_roo[2], msg.from.id) then
     Canswer(msg.cb_id, "شما مدیر نیستید \nبرای خرید ربات به پیوی :\n "..sudo_username.."\nیا به کانال زیر مراجعه کنید :\n "..channel_username.."" ,true)
   elseif not is_req(mr_roo[2], msg.from.id) then 
    Canswer(msg.cb_id, "شما این فهرست را درخواست نکردید" ,true)
	else
	local text = [[
╰☆╮ راهنمای محدودیت و ارتقا ربات: ╰☆╮

✬ برای تنظیم کرد فرد به عنوان مدیر ربات :
➳ `مدیر` [یوزرنیم | ایدی | ریپلای]
●•۰ `promote` [username | id | reply]
✦ این دستور برای تنظیم کردن شخصی به عنوان مدیر ربات در گروه میباشد.

✬ برای حذف کرد فرد از عنوان مدیر ربات :
➳ `حذف مدیر` [یوزرنیم | ایدی | ریپلای]
●•۰ `demote` [username | id | reply]
✦ این دستور برای حذف کردن شخصی از عنوان مدیر ربات در گروه میباشد.

✬ برای سکوت کردن فرد توسط ربات :
➳ `سکوت` [یوزرنیم | ایدی | ریپلای]
●•۰ `silent` [username| id| reply]
✦ این دستور برای بیصدا کردن شخص در گروه میباشد.

✬ برای حذف سکوت کردن فرد توسط ربات :
➳ `حذف سکوت` [یوزرنیم | ایدی | ریپلای]
●•۰ `unsilent` [username| id| reply]
✦ این دستور برای باصدا کردن شخص در گروه میباشد.

✬ برای اخراج کردن فرد توسط ربات :
➳ `اخراج` [یوزرنیم | ایدی | ریپلای]
●•۰ `kick` [username| id| reply]
✦ این دستور برای اخراج کردن فرد از گروه میباشد.

✬ برای مسدود کردن فرد توسط ربات :
➳ `بن` [یوزرنیم | ایدی | ریپلای]
●•۰ `ban` [username| id| reply]
✦ این دستور برای مسدود کردن فرد از گروه میباشد.

✬ برای رفع مسدود کردن فرد توسط ربات :
➳ `حذف بن` [یوزرنیم | ایدی | ریپلای]
●•۰ `unban` [username| id| reply]
✦ این دستور برای رفع مسدود کردن فرد از گروه میباشد.

✬ برای اخطار دادن به فرد توسط ربات :
➳ `اخطار` [یوزرنیم | ایدی | ریپلای]
●•۰ `warn` [username| id| reply]
✦ این دستور برای اخطار دادن به فرد در گروه میباشد.

✬ برای حذف کردن اخطار فرد توسط ربات :
➳ `حذف اخطار` [یوزرنیم | ایدی | ریپلای]
●•۰ `unwarn` [username| id| reply]
✦ این دستور برای حذف کردن اخطار فرد در گروه میباشد.

✬ برای افزودن یا خذف افراد از لیست سفید :
➳ `لیست سفید` [+-] [یوزرنیم | ایدی |ریپلی] 
●•۰ `whitelist` [+-] [username | id |reply] 
✦ این دستور برای اضافه کردن یا حذف کردن شخص از لیست سفید ربات میباشد.

✬ برای ممنوع کردن کلمه ای در گروه :
➳ `فیلتر` [کلمه]
●•۰ `filter` [word]
✦ این دستور برای ممنوع کردن کلمه ها در گروه میباشد.

✬ برای آزاد کردن کلمه ای در گروه :
➳ `حذف فیلتر` [کلمه]
●•۰ `unfilter` [word]
✦ این دستور برای آزاد کردن کلمه ها در گروه میباشد.
	]]
	keyboard = {} 
	keyboard.inline_keyboard = {
		{
			{text= '⇜ بازگشت' ,callback_data = '/helplist:'..mr_roo[2]}
		}
	}
	edit_inline(msg.message_id, text, keyboard)
	end
end
--######################################################################--
if mr_roo[1] == '/helppn' then
	if not is_mod1(mr_roo[2], msg.from.id) then
     Canswer(msg.cb_id, "شما مدیر نیستید \nبرای خرید ربات به پیوی :\n "..sudo_username.."\nیا به کانال زیر مراجعه کنید :\n "..channel_username.."" ,true)
   elseif not is_req(mr_roo[2], msg.from.id) then 
    Canswer(msg.cb_id, "شما این فهرست را درخواست نکردید" ,true)
	else
	local text = [[
╰☆╮ راهنمای پنل های ربات: ╰☆╮

✬ برای نمایش راهنمای ربات :
➳ ` راهنما`
●•۰ `help`
✦ این دستور برای نمایش راهنمای ربات میباشد.

✬ برای نمایش راهنمای ربات در پیوی :
➳ ` راهنما خصوصی`
●•۰ `helppv`
✦ این دستور برای نمایش راهنمای ربات در پیوی میباشد.

✬ برای تنظیمات مربوط به اد اجباری :
➳ `پنل اد اجباری`
●•۰ `paneladd`
✦ این دستور برای تنظیمات مربوط به اد اجباری میباشد.

✬ برای تنظیمات مربوط به اد اجباری در پیوی :
➳ `پنل اد اجباری خصوصی`
●•۰ `paneladdpv`
✦ این دستور برای تنظیمات مربوط به اد اجباری در پیوی میباشد.

✬ برای مدیریت گروه با دکمه شیشه ای :
➳ `پنل`
●•۰ `panel`
✦ این دستور برای مدیریت گروه با دکمه شیشه ای میباشد.

✬ برای مدیریت گروه با دکمه شیشه ای در پیوی :
➳ `پنل پیوی`
●•۰ `panelpv`
✦ این دستور برای مدیریت گروه با دکمه شیشه ای در پیوی میباشد.
	]]
	keyboard = {} 
	keyboard.inline_keyboard = {
		{
			{text= '⇜ بازگشت' ,callback_data = '/helplist:'..mr_roo[2]}
		}
	}
	edit_inline(msg.message_id, text, keyboard)
	end
end
--######################################################################--
if mr_roo[1] == '/helpmod' then
	if not is_mod1(mr_roo[2], msg.from.id) then
     Canswer(msg.cb_id, "شما مدیر نیستید \nبرای خرید ربات به پیوی :\n "..sudo_username.."\nیا به کانال زیر مراجعه کنید :\n "..channel_username.."" ,true)
   elseif not is_req(mr_roo[2], msg.from.id) then 
    Canswer(msg.cb_id, "شما این فهرست را درخواست نکردید" ,true)
	else
	local text = [[
╰☆╮ راهنمای مدیریتی ربات: ╰☆╮

✬ برای نمایش اطلاعات کاربری شخص :
➳ `کاربری` [یوزرنیم]
●•۰ `res` [username]
✦ این دستور برای نمایش دادن اطلاعات کاربری شخص توسط ربات میباشد.

✬ برای نمایش ایدی شخص توسط ربات :
➳ `ایدی` [ریپلای]
●•۰ `id` [reply]
✦ این دستور برای نمایش دادن ایدی شخص توسط ربات میباشد.

✬ برای نمایش اطلاعات کاربری شخص :
➳ `شناسه` [ایدی]
●•۰ `whois` [id]
✦ این دستور برای نمایش دادن اطلاعات کاربری شخص توسط ربات میباشد.

✬ برای سنجاق کردن متن در گروه توسط ربات :
➳ `سنجاق` [ریپلای]
●•۰ `pin` [reply]
✦ این دستور برای سنجاق کردن متن در گروه توسط ربات میباشد.

✬ برای حذف ینجاق کردن متن در گروه توسط ربات :
➳ `حذف سنجاق`
●•۰ `unpin`
✦ این دستور برای حذف کردن پیام سنجاق شده در گروه میباشد.

✬ برای فعال و غیرفعال کردن خوشآمد ربات :
➳ `خوشآمد [فعال] [غیرفعال]`
●•۰ `welcome [enable] [disable]`
✦ این دستور برای فعال و غیرفعال کردن حالت خوشآمدگوی ربات میباشد.

✬ برای نمایش تنظیمات اعمال شده در گروه :
➳ `تنظیمات`
●•۰ `settings`
✦ این دستور برای نمایش دادن تنظیمات اعمال شده ربات در گروه میباشد.

✬ برای نمایش قوانین گروه :
➳ `قوانین`
●•۰ `rules`
✦ این دستور برای نمایش قوانین ثبت شده در ربات میباشد.

✬ برای نمایش درباره گروه :
➳ `درباره`
●•۰ `about`
✦ این دستور برای نمایش درباره ثبت شده در ربات میباشد.

✬ برای نمایش اطلاعات شما در گروه :
➳ `ایدی`
●•۰ `id`
✦ این دستور برای نمایش اطلاعات شما توسط ربات میباشد.

✬ برای ساخت لینک جدید توسط ربات :
➳ `لینک جدید`
●•۰ `newlink`
✦ این دستور برای ساخت لینک جدید گروه توسط ربات میباشد.

✬ برای نمایش لینک گروه :
➳ `لینک`
●•۰ `link`
✦ این دستور برای نمایش لینک ثبت شده در ربات میباشد.

✬ برای ارسال لینک گروه به خصوصی شما :
➳ `لینک خصوصی`
●•۰ `linkpv`
✦ این دستور برای ارسال لینک ثبت شده در ربات به خصوصی شما میباشد.
	]]
	keyboard = {} 
	keyboard.inline_keyboard = {
		{
			{text= '⇜ بازگشت' ,callback_data = '/helplist:'..mr_roo[2]}
		}
	}
	edit_inline(msg.message_id, text, keyboard)
	end
end
--######################################################################--
if mr_roo[1] == '/helpseti' then
	if not is_mod1(mr_roo[2], msg.from.id) then
     Canswer(msg.cb_id, "شما مدیر نیستید \nبرای خرید ربات به پیوی :\n "..sudo_username.."\nیا به کانال زیر مراجعه کنید :\n "..channel_username.."" ,true)
   elseif not is_req(mr_roo[2], msg.from.id) then 
    Canswer(msg.cb_id, "شما این فهرست را درخواست نکردید" ,true)
	else
	local text = [[
╰☆╮ راهنمای تنظیمی ربات: ╰☆╮

✬ برای تنظیم کردن قوانین ربات:
➳ `تنظیم قوانین` [متن]
●•۰ `setrules` [text]
✦ این دستور برای تنظبم کردن قوانین گروه در ربات میباشد.

✬ برای تنظیم کردن نام گروه توسط ربات:
➳ `تنظیم اسم` [متن]
●•۰ `setname` [text]
✦ این دستور برای تنظبم کردن گروه میباشد.

✬ برای تنظیم کردن لینک گروه در ربات:
➳ `تنظیم لینک` [لینک]
●•۰ `setlink` [link]
✦ این دستور برای تنظبم کردن لینک گروه در ربات میباشد.

✬ برای تنظیم کردن درباره گروه:
➳ `تنظیم درباره` [متن]
●•۰ `setabout` [text]
✦ این دستور برای تنظبم کردن درباره گروه توسط ربات میباشد.

✬ برای تنظیم کردن متن خوشآمد گروه:
➳ `تنظیم خوشآمد` [متن]
●•۰ `setwelcome` [text]
✦ این دستور برای تنظبم کردن متن خوشآمد گروه در ربات میباشد.

✬ برای تنظیم کردن حداکثر اخطار های ربات:
➳ `حداکثر اخطار` [1-20]
●•۰ `setwarn` [1-20]
✦ این دستور برای تنظیم کردن حداکثر اخطار ربات در گروه میباشد.

✬ برای تنظیم کردن زمان ارسال پیام مکرر توسط ربات:
➳ `تنظیم زمان بررسی` [1-10]
●•۰ `setfloodtime` [1-10]
✦ این دستور برای تنظیم کردن زمان بین هر پیام مکرر در گروه میباشد.

✬ برای تنظیم کردن حداکثر حروف ارسالی توسط ربات:
➳ `حداکثر حروف مجاز` [عدد]
●•۰ `setchar` [Number]
✦ این دستور برای تنظیم کردن تعداد مجاز کارکتر ارسالی در گروه میباشد.

✬ برای تنظیم کردن حداکثر پیام مکرر توسط ربات:
➳ `تنظیم پیام مکرر` [1-50]
●•۰ `!setflood` [1-50]
✦ این دستور برای تنظیم کردن تعداد مجاز پیام مکرر ارسالی در گروه میباشد.
	]]
	keyboard = {} 
	keyboard.inline_keyboard = {
		{
			{text= '⇜ بازگشت' ,callback_data = '/helplist:'..mr_roo[2]}
		}
	}
	edit_inline(msg.message_id, text, keyboard)
	end
end
--######################################################################--
if mr_roo[1] == '/helplisti' then
	if not is_mod1(mr_roo[2], msg.from.id) then
     Canswer(msg.cb_id, "شما مدیر نیستید \nبرای خرید ربات به پیوی :\n "..sudo_username.."\nیا به کانال زیر مراجعه کنید :\n "..channel_username.."" ,true)
   elseif not is_req(mr_roo[2], msg.from.id) then 
    Canswer(msg.cb_id, "شما این فهرست را درخواست نکردید" ,true)
	else
	local text = [[
╰☆╮ راهنمای لیستی ربات: ╰☆╮

✬ برای نمایش افراد اخطار گرفته های گروه :
➳ `لیست اخطار`
●•۰ `warns`
✦ این دستور برای نمایش دادن افراد اخطار گرفته توسط ربات در گروه میباشد.

✬ برای نمایش کلمات ممنوع شده گروه :
➳ `لیست فیلتر`
●•۰ `filterlist`
✦ این دستور برای نمایش دادن کلمات ممنوع شده توسط ربات گروه میباشد.

✬ برای نمایش افراد مسدود شده گروه :
➳ `لیست بن`
●•۰ `banlist`
✦ این دستور برای نمایش دادن افراد مسدود شده توسط ربات گروه میباشد.

✬ برای نمایش مالکین گروه :
➳ `لیست مالکان`
●•۰ `ownerlist`
✦ این دستور برای نمایش دادن مالکین ربات در گروه میباشد.

✬ برای نمایش مدیران گروه :
➳ `لیست مدیران`
●•۰ `modlist`
✦ این دستور برای نمایش دادن مدیران ربات در گروه میباشد.

✬ برای نمایش افراد سفید شده گروه :
➳ `لیست سفیذ`
●•۰ `whitelist`
✦ این دستور برای نمایش دادن افراد سفید شده توسط ربات گروه میباشد.

✬ برای نمایش سکوت شده های گروه :
➳ `لیست سکوت`
●•۰ `silentlist`
✦ این دستور برای نمایش دادن افراد بیصدا شده توسط ربات در گروه میباشد.
	]]
	keyboard = {} 
	keyboard.inline_keyboard = {
		{
			{text= '⇜ بازگشت' ,callback_data = '/helplist:'..mr_roo[2]}
		}
	}
	edit_inline(msg.message_id, text, keyboard)
	end
end
--######################################################################--
if mr_roo[1] == '/helpclean' then
	if not is_mod1(mr_roo[2], msg.from.id) then
     Canswer(msg.cb_id, "شما مدیر نیستید \nبرای خرید ربات به پیوی :\n "..sudo_username.."\nیا به کانال زیر مراجعه کنید :\n "..channel_username.."" ,true)
   elseif not is_req(mr_roo[2], msg.from.id) then 
    Canswer(msg.cb_id, "شما این فهرست را درخواست نکردید" ,true)
	else
	local text = [[
╰☆╮ راهنمای پاکسازی لیستی ربات : ╰☆╮

✬ برای پاک کردن لیست بن شده ها توسط ربات :
➳ `پاک کردن لیست بن`
●•۰ `clean bans`
✦ این دستور برای رفع بن کردن تمام کاربران بن شده در گروه میباشد.

✬ برای پاک کردن لیست اخطارها ها توسط ربات :
➳ `پاک کردن اخطار ها`
●•۰ `clean warns`
✦ این دستور برای پاک کردن کردن تمام اخطار تمام کاربران گروه میباشد.

✬ برای پاک کردن لیست سکوت شده ها توسط ربات :
➳ `پاک کردن لیست سکوت`
●•۰ `clean silentlist`
✦ این دستور برای رفع سکوت کردن تمام کاربران سکوت شده در گروه میباشد.

✬ برای پاک کردن کلمات فیلتر شده توسط ربات :
➳ `پاک کردن لیست فیلتر`
●•۰ `clean filterlist`
✦ این دستور برای پاک کردن تمام کلمات ممنوع شده در گروه میباشد.

✬ برای پاک کردن ربات ها توسط ربات :
➳ `پاک کردن ربات ها`
●•۰ `clean bots`
✦ این دستور برای پاک کردن تمام ربات های مخرب در گروه میباشد.

✬ برای پاک کردن لیست سیاه توسط ربات :
➳ `پاک کردن لیست سیاه`
●•۰ `clean blacklist`
✦ این دستور برای پاک کردن لیست سیاه گروه میباشد.

✬ برای پاک کردن لیست دیلت اکانتی ها توسط ربات :
➳ `پاک کردن اکانت های دلیت شده`
●•۰ `clean deleted`
✦ این دستور برای پاک کردن لیست دیلت اکانتی ها گروه میباشد.

✬ برای پاک کردن لیست مدیرهای ربات :
➳ `پاک کردن مدیران`
●•۰ `clean mods`
✦ این دستور برای پاک کردن لیست مدیرهای ربات در گروه میباشد.

✬ برای پاک کردن قوانین ثبت شده در ربات :
➳ `پاک کردن قوانین`
●•۰ `clean rules`
✦ این دستور برای پاک قوانین ثبت شده در ربات برای گروه میباشد.

✬ برای پاک کردن درباره ثبت شده در ربات :
➳ `پاک کردن درباره`
●•۰ `clean about`
✦ این دستور برای پاک درباره ثبت شده در ربات برای گروه میباشد.
	]]
	keyboard = {} 
	keyboard.inline_keyboard = {
		{
			{text= '⇜ بازگشت' ,callback_data = '/helplist:'..mr_roo[2]}
		}
	}
	edit_inline(msg.message_id, text, keyboard)
	end
end
--######################################################################--
if mr_roo[1] == '/helpclean1' then
	if not is_mod1(mr_roo[2], msg.from.id) then
     Canswer(msg.cb_id, "شما مدیر نیستید \nبرای خرید ربات به پیوی :\n "..sudo_username.."\nیا به کانال زیر مراجعه کنید :\n "..channel_username.."" ,true)
   elseif not is_req(mr_roo[2], msg.from.id) then 
    Canswer(msg.cb_id, "شما این فهرست را درخواست نکردید" ,true)
	else
	local text = [[
╰☆╮ راهنمای پاکسازی پیام ربات : ╰☆╮

✬ برای پاک کردن تمام پیام های گروه توسط ربات :
➳ `پاکسازی پیام ها`
●•۰ `clean msgs`
✦ این دستور برای پاکسازی تمام پیام های گروه میباشد.

✬ برای پاک کردن تعدادی از پیام ها توسط ربات :
➳ `پاکسازی` [1-100]
●•۰ `rmsg` [1-100]
✦ این دستور برای پاکسازی تعداد تعیین شده پیام های گروه میباشد.

✬ برای پاک کردن پیام های خود شخص توسط ربات :
➳ `پاکسازی پیام های من`
●•۰ `mydel`
✦ این دستور برای پاکسازی تمام پیام های شخص در گروه میباشد.

✬ برای پاک کردن تمام پیام های یک شخص توسط ربات :
➳ `حذف پیام` [ریپلای]
●•۰ `delall` [replay]
✦ این دستور برای پاکسازی تمام پیام های شخص انتخاب شده در گروه میباشد.

✬ برای پاک یک پیام توسط ربات :
➳ `حذف` [ریپلای]
●•۰ `dela` [replay]
✦ این دستور برای پاکسازی پیام انتخاب شده در گروه میباشد.
	]]
	keyboard = {} 
	keyboard.inline_keyboard = {
		{
			{text= '⇜ بازگشت' ,callback_data = '/helplist:'..mr_roo[2]}
		}
	}
	edit_inline(msg.message_id, text, keyboard)
	end
end
--######################################################################--
if mr_roo[1] == '/helpfun' then
	if not is_mod1(mr_roo[2], msg.from.id) then
     Canswer(msg.cb_id, "شما مدیر نیستید \nبرای خرید ربات به پیوی :\n "..sudo_username.."\nیا به کانال زیر مراجعه کنید :\n "..channel_username.."" ,true)
   elseif not is_req(mr_roo[2], msg.from.id) then 
    Canswer(msg.cb_id, "شما این فهرست را درخواست نکردید" ,true)
	else
	local text = [[
╰☆╮ راهنمای سرگرمی ربات: ╰☆╮

✬ برای دریاف آب و هوای توسط ربات:
➳ `weaeter` [sity]
●•۰ `اب و هوا` [شهر]
✦ این دستور برای دریافت آب و هوای منطقه مورد نظر میباشد.
 
✬ برای انجام دادن عملیات بین دو عدد توسط ربات:
➳ `calc` [number]
●•۰ `ماشین حساب` [عدد]
✦ این دستور برای به دست آوردن عملیات های بین دو عدد میباشد.

✬ برای دریافت زمان توسط ربات:
➳ `time`
●•۰ `ساعت`
✦ این دستور برای نمایش ساعت و تاریخ به صورت آنلاین میباشد.

✬ برای دریافت عکس و استیکر +18 توسط ربات:
➳ `sexy`
●•۰ `سکسی`
✦ این دستور برای نمایش عکس و استیکر های +18 میباشد.

✬ برای تبدیل استیکر به عکس توسط ربات:
➳ `tophoto` [reply]
●•۰ `تبدیل به عکس` [ریپلای]
✦ این دستور برای تبدیل کردن انواع استیکر به عکس میباشد.

✬ برای تبدیل عکس به استیکر توسط ربات:
➳ `sticker` [reply]
●•۰ `تبدیل به استیکر` [ریپلای]
✦ این دستور برای تبدیل کردن انواع عکس به استیکر میباشد.

✬ برای تبدیل متن به صدا توسط ربات:
➳ `voice` [text]
●•۰ `تبدیل به صدا` [متن]
✦ این دستور برای تبدیل کردن متن به صدا میباشد.

✬ برای دریافت اوقات شرعی توسط ربات:
➳ `praytime` [sity]
●•۰ `ساعت شرعی` [شهر]
✦ این دستور برای دریافت اوقات شرعی منطقه مورد نظر میباشد.

✬ برای ترجمه فارسی به انگلیسی یا بلعکس توسط ربات:
➳ `tr` [en/fa] [word]
●•۰ `ترجمه` [en/fa] [کلمه]
✦ این دستور برای ترجمه متون فارسی و انگلیسی میباشد.

✬ برای طراحی متن به شکل ایموجی توسط ربات:
➳ `emoji` [text]
●•۰ `شکلک` [متن]
✦ این دستور برای طراحی متن به شکل ایموجی میباشد.

✬ برای طراحی کوتاه کردن لینک توسط ربات:
➳ `short` [link]
●•۰ `لینک کوتاه` [لینک]
✦ این دستور برای کوتاه سازی لینک میباشد.

✬ برای طراحی متن به عکس توسط ربات:
➳ `photo` [text]
●•۰ `عکس` [متن]
✦ این دستور برای طراحی متن به صورت عکس میباشد.

✬ برای طراحی متن به استیکر توسط ربات:
➳ `sticker` [text]
●•۰ `استیکر` [متن]
✦ این دستور برای طراحی متن به صورت استیکر میباشد.

✬ برای زیبا سازی یک متن توسط ربات:
➳ `font` [text]
●•۰ `زیبانویس` [متن]
✦ این دستور برای زیباسازی یک متن به اشکال مختلف میباشد.

✬ برای طراحی متن به گیف توسط ربات:
➳ `gif` [text]
●•۰ `گیف` [متن]
✦ این دستور برای طراحی متن به صورت گیف میباشد.

✬ برای جستجو در آپارات و دریافت ویدیو توسط ربات:
➳ `aparat` [text]
●•۰ `آپارات` [متن]
✦ این دستور برای جستجو و دریافت لینک دانلود از آپارات میباشد.

✬ برای جستجو و دریافت موزیک توسط ربات:
➳ `song` [artist name]
●•۰ `آهنگ` [نام خواننده]
✦ این دستور برای جستجو و دریافت لینک دانلود موزیک میباشد.

✬ برای دانلود و ارسال موزیک توسط ربات:
➳ `dlmusic` [link.mp3]
●•۰ `دانلود آهنگ` [لینک مستقیم]
✦ این دستور برای دانلود و ارسال یک موزیک با لینک مستقیم میباشد.

✬ برای نظرسنجی در گروه توسط ربات:
➳ `like` [text]
●•۰ `نظرسنجی` [متن]
✦ این دستور برای نظرسنجی در گروه میباشد.

✬ برای جستجوی تیکه آهنگ توسط ربات:
➳ `ahang` [text]
●•۰ `تیکه آهنگ` [متن]
✦ این دستور برای جستجوی تیکه آهنگ میباشد.
	]]
	keyboard = {} 
	keyboard.inline_keyboard = {
		{
			{text= '⇜ بازگشت' ,callback_data = '/helplist:'..mr_roo[2]}
		}
	}
	edit_inline(msg.message_id, text, keyboard)
	end
end
--######################################################################--
if mr_roo[1] == '/lockh1' then
	if not is_mod1(mr_roo[2], msg.from.id) then
     Canswer(msg.cb_id, "شما مدیر نیستید \nبرای خرید ربات به پیوی :\n "..sudo_username.."\nیا به کانال زیر مراجعه کنید :\n "..channel_username.."" ,true)
   elseif not is_req(mr_roo[2], msg.from.id) then 
        Canswer(msg.cb_id, "شما این فهرست را درخواست نکردید" ,true) 
	else
	local text = [[
`•• راهنمای مربوط به قفل همه :`

*> برای قفل کردن همه در گروه :*
• `Lock all`
• `قفل همه`

_○ این دستور برای (حذف) پیام های کل گروه که کاربران ارسال میکنند استفاده میشود !_
------------------------------------------
*> برای آزاد سازی تمامی قفل ها :*
• `UnLock all`
• `باز کردن همه`

_○ این دستور برای بازکردن تمامی قفل هایی  که کاربران رو محدود میکند استفاده میشود !_
	]]
	keyboard = {} 
	keyboard.inline_keyboard = {
		{
			{text= '⇜ بازگشت' ,callback_data = '/helplock:'..mr_roo[2]}
		}
	}
	edit_inline(msg.message_id, text, keyboard)
	end
end
--######################################################################--
if mr_roo[1] == '/lockh2' then
	if not is_mod1(mr_roo[2], msg.from.id) then
     Canswer(msg.cb_id, "شما مدیر نیستید \nبرای خرید ربات به پیوی :\n "..sudo_username.."\nیا به کانال زیر مراجعه کنید :\n "..channel_username.."" ,true)
   elseif not is_req(mr_roo[2], msg.from.id) then 
        Canswer(msg.cb_id, "شما این فهرست را درخواست نکردید" ,true) 
	else
	local text = [[
`•• راهنمای مربوط به ارسال لینک :`

*> برای قفل کردن لینک در گروه :*
• `Lock link`
• `قفل لینک`

_○ این دستور برای (حذف) پیام های مکرر که در آن ها لینک به کار رفته است استفاده میشود !_
------------------------------------------
*> برای اخطار دادن لینک در گروه :*
• `Warn link`
• `اخطار لینک`

_○ این دستور برای (اخطار) به کاربرانی که پیام آنها حاوی لینک میباشد است !_
------------------------------------------
*> برای اخطار دادن لینک در گروه :*
• `Mute link`
• `سکوت لینک`

_○ این دستور برای (سکوت) کردن کاربرانی که پیام آنها حاوی لینک میباشد است !_
------------------------------------------
*> برای اخطار دادن لینک در گروه :*
• `Kick link`
• `اخراج لینک`

_○ این دستور برای (اخراج) کردن کاربرانی که پیام آنها حاوی لینک میباشد است !_
------------------------------------------
*> برای آزاد سازی تمامی قفل ها :*
• `UnLock link`
• `باز کردن لینک`

_○ این دستور برای بازکردن تمامی قفل هایی  که کاربران رو محدود میکند استفاده میشود !_
	]]
	keyboard = {} 
	keyboard.inline_keyboard = {
		{
			{text= '⇜ بازگشت' ,callback_data = '/helplock:'..mr_roo[2]}
		}
	}
	edit_inline(msg.message_id, text, keyboard)
	end
end
--######################################################################--
if mr_roo[1] == '/lockh3' then
	if not is_mod1(mr_roo[2], msg.from.id) then
     Canswer(msg.cb_id, "شما مدیر نیستید \nبرای خرید ربات به پیوی :\n "..sudo_username.."\nیا به کانال زیر مراجعه کنید :\n "..channel_username.."" ,true)
   elseif not is_req(mr_roo[2], msg.from.id) then 
        Canswer(msg.cb_id, "شما این فهرست را درخواست نکردید" ,true) 
	else
	local text = [[
`•• راهنمای مربوط به ارسال فوروارد   :`

*> برای قفل کردن فوروارد در گروه :*
• `Lock forward`
• `قفل فوروارد`

_○ این دستور برای (حذف) پیام های فوروارد از کاربر یا کانال ارسال شده استفاده میشود !_
------------------------------------------
*> برای اخطار دادن فوروارد در گروه :*
• `Warn forward`
• `اخطار فوروارد`

_○ این دستور برای (اخطار) به کاربرانی که پیام آنها فوروارد است !_
------------------------------------------
*> برای اخطار دادن فوروارد در گروه :*
• `Mute forward`
• `سکوت فوروارد`

_○ این دستور برای (سکوت) کردن کاربرانی که پیام آنها فوروارد است !_
------------------------------------------
*> برای اخطار دادن فوروارد در گروه :*
• `Kick forward`
• `اخراج فوروارد`

_○ این دستور برای (اخراج) کردن کاربرانی که پیام آنها فوروارد  است !_
------------------------------------------
*> برای آزاد سازی تمامی قفل ها :*
• `UnLock forward`
• `باز کردن فوروارد`

_○ این دستور برای بازکردن تمامی قفل هایی  که کاربران رو محدود میکند استفاده میشود !_
	]]
	keyboard = {} 
	keyboard.inline_keyboard = {
		{
			{text= '⇜ بازگشت' ,callback_data = '/helplock:'..mr_roo[2]}
		}
	}
	edit_inline(msg.message_id, text, keyboard)
	end
end
--######################################################################--
if mr_roo[1] == '/lockh4' then
	if not is_mod1(mr_roo[2], msg.from.id) then
     Canswer(msg.cb_id, "شما مدیر نیستید \nبرای خرید ربات به پیوی :\n "..sudo_username.."\nیا به کانال زیر مراجعه کنید :\n "..channel_username.."" ,true)
   elseif not is_req(mr_roo[2], msg.from.id) then 
        Canswer(msg.cb_id, "شما این فهرست را درخواست نکردید" ,true) 
	else
	local text = [[
`•• راهنمای مربوط به ارسال تگ :`

*> برای قفل کردن تگ در گروه :*
• `Lock tag`
• `قفل تگ`

_○ این دستور برای (حذف) پیام های مکرر که در آن ها تگ به کار رفته است استفاده میشود !_
------------------------------------------
*> برای اخطار دادن تگ در گروه :*
• `Warn tag`
• `اخطار تگ`

_○ این دستور برای (اخطار) به کاربرانی که پیام آنها حاوی تگ میباشد است !_
------------------------------------------
*> برای اخطار دادن تگ در گروه :*
• `Mute tag`
• `سکوت تگ`

_○ این دستور برای (سکوت) کردن کاربرانی که پیام آنها حاوی تگ میباشد است !_
------------------------------------------
*> برای اخطار دادن تگ در گروه :*
• `Kick tag`
• `اخراج تگ`

_○ این دستور برای (اخراج) کردن کاربرانی که پیام آنها حاوی تگ میباشد است !_
------------------------------------------
*> برای آزاد سازی تمامی قفل ها :*
• `UnLock tag`
• `باز کردن تگ`

_○ این دستور برای بازکردن تمامی قفل هایی  که کاربران رو محدود میکند استفاده میشود !_
	]]
	keyboard = {} 
	keyboard.inline_keyboard = {
		{
			{text= '⇜ بازگشت' ,callback_data = '/helplock:'..mr_roo[2]}
		}
	}
	edit_inline(msg.message_id, text, keyboard)
	end
end
--######################################################################--
if mr_roo[1] == '/lockh5' then
	if not is_mod1(mr_roo[2], msg.from.id) then
     Canswer(msg.cb_id, "شما مدیر نیستید \nبرای خرید ربات به پیوی :\n "..sudo_username.."\nیا به کانال زیر مراجعه کنید :\n "..channel_username.."" ,true)
   elseif not is_req(mr_roo[2], msg.from.id) then 
        Canswer(msg.cb_id, "شما این فهرست را درخواست نکردید" ,true) 
	else
	local text = [[
`•• راهنمای مربوط به ارسال منشن :`

*> برای قفل کردن منشن در گروه :*
• `Lock mention`
• `قفل منشن`

_○ این دستور برای (حذف) پیام های که در آن ها منشن به کار رفته است استفاده میشود !_
------------------------------------------
*> برای اخطار دادن منشن در گروه :*
• `Warn mention`
• `اخطار منشن`

_○ این دستور برای (اخطار) به کاربرانی که پیام آنها حاوی منشن میباشد است !_
------------------------------------------
*> برای اخطار دادن منشن در گروه :*
• `Mute mention`
• `سکوت منشن`

_○ این دستور برای (سکوت) کردن کاربرانی که پیام آنها حاوی منشن میباشد است !_
------------------------------------------
*> برای اخطار دادن منشن در گروه :*
• `Kick mention`
• `اخراج منشن`

_○ این دستور برای (اخراج) کردن کاربرانی که پیام آنها حاوی منشن میباشد است !_
------------------------------------------
*> برای آزاد سازی تمامی قفل ها :*
• `UnLock mention`
• `باز کردن منشن`

_○ این دستور برای بازکردن تمامی قفل هایی  که کاربران رو محدود میکند استفاده میشود !_
	]]
	keyboard = {} 
	keyboard.inline_keyboard = {
		{
			{text= '⇜ بازگشت' ,callback_data = '/helplock:'..mr_roo[2]}
		}
	}
	edit_inline(msg.message_id, text, keyboard)
	end
end
--######################################################################--
if mr_roo[1] == '/lockh6' then
	if not is_mod1(mr_roo[2], msg.from.id) then
     Canswer(msg.cb_id, "شما مدیر نیستید \nبرای خرید ربات به پیوی :\n "..sudo_username.."\nیا به کانال زیر مراجعه کنید :\n "..channel_username.."" ,true)
   elseif not is_req(mr_roo[2], msg.from.id) then 
        Canswer(msg.cb_id, "شما این فهرست را درخواست نکردید" ,true) 
	else
	local text = [[
`•• راهنمای مربوط به ارسال فارسی :`

*> برای قفل کردن فارسی در گروه :*
• `Lock farsi`
• `قفل فارسی`

_○ این دستور برای (حذف) پیام های که در آن ها فارسی به کار رفته است استفاده میشود !_
------------------------------------------
*> برای اخطار دادن فارسی در گروه :*
• `Warn farsi`
• `اخطار فارسی`

_○ این دستور برای (اخطار) به کاربرانی که پیام آنها حاوی فارسی میباشد است !_
------------------------------------------
*> برای اخطار دادن فارسی در گروه :*
• `Mute farsi`
• `سکوت فارسی`

_○ این دستور برای (سکوت) کردن کاربرانی که پیام آنها حاوی فارسی میباشد است !_
------------------------------------------
*> برای اخطار دادن فارسی در گروه :*
• `Kick farsi`
• `اخراج فارسی`

_○ این دستور برای (اخراج) کردن کاربرانی که پیام آنها حاوی فارسی میباشد است !_
------------------------------------------
*> برای آزاد سازی تمامی قفل ها :*
• `UnLock farsi`
• `باز کردن فارسی`

_○ این دستور برای بازکردن تمامی قفل هایی  که کاربران رو محدود میکند استفاده میشود !_
	]]
	keyboard = {} 
	keyboard.inline_keyboard = {
		{
			{text= '⇜ بازگشت' ,callback_data = '/helplock:'..mr_roo[2]}
		}
	}
	edit_inline(msg.message_id, text, keyboard)
	end
end
--######################################################################--
if mr_roo[1] == '/lockh7' then
	if not is_mod1(mr_roo[2], msg.from.id) then
     Canswer(msg.cb_id, "شما مدیر نیستید \nبرای خرید ربات به پیوی :\n "..sudo_username.."\nیا به کانال زیر مراجعه کنید :\n "..channel_username.."" ,true)
   elseif not is_req(mr_roo[2], msg.from.id) then 
        Canswer(msg.cb_id, "شما این فهرست را درخواست نکردید" ,true) 
	else
	local text = [[
`•• راهنمای مربوط به ارسال ویرایش :`

*> برای قفل کردن ویرایش در گروه :*
• `Lock edit`
• `قفل ویرایش`

_○ این دستور برای (حذف) پیام های که در آن ها ویرایش میشوند استفاده میشود !_
------------------------------------------
*> برای اخطار دادن ویرایش در گروه :*
• `Warn edit`
• `اخطار ویرایش`

_○ این دستور برای (اخطار) به کاربرانی که پیام آنها ویرایش شده است !_
------------------------------------------
*> برای اخطار دادن ویرایش در گروه :*
• `Mute edit`
• `سکوت ویرایش`

_○ این دستور برای (سکوت) کردن کاربرانی که پیام آنها ویرایش شده است !_
------------------------------------------
*> برای اخطار دادن ویرایش در گروه :*
• `Kick edit`
• `اخراج ویرایش`

_○ این دستور برای (اخراج) کردن کاربرانی که پیام آنها ویرایش شده است !_
------------------------------------------
*> برای آزاد سازی تمامی قفل ها :*
• `UnLock edit`
• `باز کردن ویرایش`

_○ این دستور برای بازکردن تمامی قفل هایی  که کاربران رو محدود میکند استفاده میشود !_
	]]
	keyboard = {} 
	keyboard.inline_keyboard = {
		{
			{text= '⇜ بازگشت' ,callback_data = '/helplock:'..mr_roo[2]}
		}
	}
	edit_inline(msg.message_id, text, keyboard)
	end
end
--######################################################################--
if mr_roo[1] == '/lockh8' then
	if not is_mod1(mr_roo[2], msg.from.id) then
     Canswer(msg.cb_id, "شما مدیر نیستید \nبرای خرید ربات به پیوی :\n "..sudo_username.."\nیا به کانال زیر مراجعه کنید :\n "..channel_username.."" ,true)
   elseif not is_req(mr_roo[2], msg.from.id) then 
        Canswer(msg.cb_id, "شما این فهرست را درخواست نکردید" ,true) 
	else
	local text = [[
`•• راهنمای مربوط به ارسال هرزنامه :`

*> برای قفل کردن هرزنامه در گروه :*
• `Lock spam`
• `قفل هرزنامه`

_○ این دستور برای (حذف) پیام های مکرر که ارسال شده و هرزنامه است استفاده میشود !_
------------------------------------------
*> برای آزاد سازی تمامی قفل ها :*
• `UnLock spam`
• `باز کردن هرزنامه`

_○ این دستور برای بازکردن تمامی قفل هایی  که کاربران رو محدود میکند استفاده میشود !_
	]]
	keyboard = {} 
	keyboard.inline_keyboard = {
		{
			{text= '⇜ بازگشت' ,callback_data = '/helplock:'..mr_roo[2]}
		}
	}
	edit_inline(msg.message_id, text, keyboard)
	end
end
--######################################################################--
if mr_roo[1] == '/lockh9' then
	if not is_mod1(mr_roo[2], msg.from.id) then
     Canswer(msg.cb_id, "شما مدیر نیستید \nبرای خرید ربات به پیوی :\n "..sudo_username.."\nیا به کانال زیر مراجعه کنید :\n "..channel_username.."" ,true)
   elseif not is_req(mr_roo[2], msg.from.id) then 
        Canswer(msg.cb_id, "شما این فهرست را درخواست نکردید" ,true) 
	else
	local text = [[
`•• راهنمای مربوط به ارسال پیام مکرر :`

*> برای قفل کردن پیام مکرر در گروه :*
• `Lock flood`
• `قفل پیام مکرر`

_○ این دستور برای (حذف)  پیام های مکرر  استفاده میشود !_
------------------------------------------
*> برای آزاد سازی تمامی قفل ها :*
• `UnLock flood`
• `باز کردن پیام مکرر`

_○ این دستور برای بازکردن تمامی قفل هایی  که کاربران رو محدود میکند استفاده میشود !_
	]]
	keyboard = {} 
	keyboard.inline_keyboard = {
		{
			{text= '⇜ بازگشت' ,callback_data = '/helplock:'..mr_roo[2]}
		}
	}
	edit_inline(msg.message_id, text, keyboard)
	end
end
--######################################################################--
if mr_roo[1] == '/lockh10' then
	if not is_mod1(mr_roo[2], msg.from.id) then
     Canswer(msg.cb_id, "شما مدیر نیستید \nبرای خرید ربات به پیوی :\n "..sudo_username.."\nیا به کانال زیر مراجعه کنید :\n "..channel_username.."" ,true)
   elseif not is_req(mr_roo[2], msg.from.id) then 
        Canswer(msg.cb_id, "شما این فهرست را درخواست نکردید" ,true) 
	else
	local text = [[
`•• راهنمای مربوط به ارسال ربات :`

*> برای قفل کردن ربات در گروه :*
• `Lock bots`
• `قفل ربات`

_○ این دستور برای (حذف) تمامی ربات هایی که به گروه اضافه میشوند استفاده میشود !_
------------------------------------------
*> برای آزاد سازی تمامی قفل ها :*
• `UnLock bots`
• `باز کردن ربات`

_○ این دستور برای بازکردن تمامی قفل هایی  که کاربران رو محدود میکند استفاده میشود !_
	]]
	keyboard = {} 
	keyboard.inline_keyboard = {
		{
			{text= '⇜ بازگشت' ,callback_data = '/helplock:'..mr_roo[2]}
		}
	}
	edit_inline(msg.message_id, text, keyboard)
	end
end
--######################################################################--
if mr_roo[1] == '/lockh11' then
	if not is_mod1(mr_roo[2], msg.from.id) then
     Canswer(msg.cb_id, "شما مدیر نیستید \nبرای خرید ربات به پیوی :\n "..sudo_username.."\nیا به کانال زیر مراجعه کنید :\n "..channel_username.."" ,true)
   elseif not is_req(mr_roo[2], msg.from.id) then 
        Canswer(msg.cb_id, "شما این فهرست را درخواست نکردید" ,true) 
	else
	local text = [[
`•• راهنمای مربوط به ارسال فونت :`

*> برای قفل کردن فونت در گروه :*
• `Lock markdown`
• `قفل فونت`

_○ این دستور برای (حذف) پیام های  که در آن ها فونت به کار رفته است استفاده میشود !_
------------------------------------------
*> برای اخطار دادن فونت در گروه :*
• `Warn markdown`
• `اخطار فونت`

_○ این دستور برای (اخطار) به کاربرانی که پیام آنها حاوی فونت میباشد است !_
------------------------------------------
*> برای اخطار دادن فونت در گروه :*
• `Mute markdown`
• `سکوت فونت`

_○ این دستور برای (سکوت) کردن کاربرانی که پیام آنها حاوی فونت میباشد است !_
------------------------------------------
*> برای اخطار دادن فونت در گروه :*
• `Kick markdown`
• `اخراج فونت`

_○ این دستور برای (اخراج) کردن کاربرانی که پیام آنها حاوی فونت میباشد است !_
------------------------------------------
*> برای آزاد سازی تمامی قفل ها :*
• `UnLock markdown`
• `باز کردن فونت`

_○ این دستور برای بازکردن تمامی قفل هایی  که کاربران رو محدود میکند استفاده میشود !_
	]]
	keyboard = {} 
	keyboard.inline_keyboard = {
		{
			{text= '⇜ بازگشت' ,callback_data = '/helplock:'..mr_roo[2]}
		}
	}
	edit_inline(msg.message_id, text, keyboard)
	end
end
--######################################################################--
if mr_roo[1] == '/lockh12' then
	if not is_mod1(mr_roo[2], msg.from.id) then
     Canswer(msg.cb_id, "شما مدیر نیستید \nبرای خرید ربات به پیوی :\n "..sudo_username.."\nیا به کانال زیر مراجعه کنید :\n "..channel_username.."" ,true)
   elseif not is_req(mr_roo[2], msg.from.id) then 
        Canswer(msg.cb_id, "شما این فهرست را درخواست نکردید" ,true) 
	else
	local text = [[
`•• راهنمای مربوط به ارسال وب :`

*> برای قفل کردن وب در گروه :*
• `Lock webpage`
• `قفل وب`

_○ این دستور برای (حذف) پیام های که در آن ها ادرس وب به کار رفته است استفاده میشود !_
------------------------------------------
*> برای اخطار دادن وب در گروه :*
• `Warn webpage`
• `اخطار وب`

_○ این دستور برای (اخطار) به کاربرانی که پیام آنها حاوی ادرس وب میباشد است !_
------------------------------------------
*> برای اخطار دادن وب در گروه :*
• `Mute webpage`
• `سکوت وب`

_○ این دستور برای (سکوت) کردن کاربرانی که پیام آنها حاوی ادرس وب میباشد است !_
------------------------------------------
*> برای اخطار دادن وب در گروه :*
• `Kick webpage`
• `اخراج وب`

_○ این دستور برای (اخراج) کردن کاربرانی که پیام آنها حاوی ادرس وب میباشد است !_
------------------------------------------
*> برای آزاد سازی تمامی قفل ها :*
• `UnLock webpage`
• `باز کردن وب`

_○ این دستور برای بازکردن تمامی قفل هایی  که کاربران رو محدود میکند استفاده میشود !_
	]]
	keyboard = {} 
	keyboard.inline_keyboard = {
		{
			{text= '⇜ بازگشت' ,callback_data = '/helplock:'..mr_roo[2]}
		}
	}
	edit_inline(msg.message_id, text, keyboard)
	end
end
--######################################################################--
if mr_roo[1] == '/lockh13' then
	if not is_mod1(mr_roo[2], msg.from.id) then
     Canswer(msg.cb_id, "شما مدیر نیستید \nبرای خرید ربات به پیوی :\n "..sudo_username.."\nیا به کانال زیر مراجعه کنید :\n "..channel_username.."" ,true)
   elseif not is_req(mr_roo[2], msg.from.id) then 
        Canswer(msg.cb_id, "شما این فهرست را درخواست نکردید" ,true) 
	else
	local text = [[
`•• راهنمای مربوط به ارسال سنجاق :`

*> برای قفل کردن سنجاق در گروه :*
• `Lock pin`
• `قفل سنجاق`

_○ این دستور برای (حذف) پیام های که سنجاق شده توسط ادمین گروه استفاده میشود !_
------------------------------------------
*> برای آزاد سازی تمامی قفل ها :*
• `UnLock pin`
• `باز کردن سنجاق`

_○ این دستور برای بازکردن تمامی قفل هایی  که کاربران رو محدود میکند استفاده میشود !_
	]]
	keyboard = {} 
	keyboard.inline_keyboard = {
		{
			{text= '⇜ بازگشت' ,callback_data = '/helplock:'..mr_roo[2]}
		}
	}
	edit_inline(msg.message_id, text, keyboard)
	end
end
--######################################################################--
if mr_roo[1] == '/lockh14' then
	if not is_mod1(mr_roo[2], msg.from.id) then
     Canswer(msg.cb_id, "شما مدیر نیستید \nبرای خرید ربات به پیوی :\n "..sudo_username.."\nیا به کانال زیر مراجعه کنید :\n "..channel_username.."" ,true)
   elseif not is_req(mr_roo[2], msg.from.id) then 
        Canswer(msg.cb_id, "شما این فهرست را درخواست نکردید" ,true) 
	else
	local text = [[
`•• راهنمای مربوط به ارسال ورود :`

*> برای قفل کردن ورود در گروه :*
• `Lock join`
• `قفل ورود`

_○ این دستور برای (حذف) افرادی که به گروه وارد میشوند استفاده میشود !_
------------------------------------------
*> برای آزاد سازی تمامی قفل ها :*
• `UnLock join`
• `باز کردن ورود`

_○ این دستور برای بازکردن تمامی قفل هایی  که کاربران رو محدود میکند استفاده میشود !_
	]]
	keyboard = {} 
	keyboard.inline_keyboard = {
		{
			{text= '⇜ بازگشت' ,callback_data = '/helplock:'..mr_roo[2]}
		}
	}
	edit_inline(msg.message_id, text, keyboard)
	end
end
--######################################################################--
if mr_roo[1] == '/lockh15' then
	if not is_mod1(mr_roo[2], msg.from.id) then
     Canswer(msg.cb_id, "شما مدیر نیستید \nبرای خرید ربات به پیوی :\n "..sudo_username.."\nیا به کانال زیر مراجعه کنید :\n "..channel_username.."" ,true)
   elseif not is_req(mr_roo[2], msg.from.id) then 
        Canswer(msg.cb_id, "شما این فهرست را درخواست نکردید" ,true) 
	else
	local text = [[
`•• راهنمای مربوط به ارسال گیف :`

*> برای قفل کردن گیف در گروه :*
• `Lock gif`
• `قفل گیف`

_○ این دستور برای (حذف) پیام های که در آن ها گیف به کار رفته است استفاده میشود !_
------------------------------------------
*> برای اخطار دادن گیف در گروه :*
• `Warn gif`
• `اخطار گیف`

_○ این دستور برای (اخطار) به کاربرانی که پیام آنها حاوی گیف میباشد است !_
------------------------------------------
*> برای اخطار دادن گیف در گروه :*
• `Mute gif`
• `سکوت گیف`

_○ این دستور برای (سکوت) کردن کاربرانی که پیام آنها حاوی گیف میباشد است !_
------------------------------------------
*> برای اخطار دادن گیف در گروه :*
• `Kick gif`
• `اخراج گیف`

_○ این دستور برای (اخراج) کردن کاربرانی که پیام آنها حاوی گیف میباشد است !_
------------------------------------------
*> برای آزاد سازی تمامی قفل ها :*
• `UnLock gif`
• `باز کردن گیف`

_○ این دستور برای بازکردن تمامی قفل هایی  که کاربران رو محدود میکند استفاده میشود !_
	]]
	keyboard = {} 
	keyboard.inline_keyboard = {
		{
			{text= '⇜ بازگشت' ,callback_data = '/helplock:'..mr_roo[2]}
		}
	}
	edit_inline(msg.message_id, text, keyboard)
	end
end
--######################################################################--
if mr_roo[1] == '/lockh16' then
	if not is_mod1(mr_roo[2], msg.from.id) then
     Canswer(msg.cb_id, "شما مدیر نیستید \nبرای خرید ربات به پیوی :\n "..sudo_username.."\nیا به کانال زیر مراجعه کنید :\n "..channel_username.."" ,true)
   elseif not is_req(mr_roo[2], msg.from.id) then 
        Canswer(msg.cb_id, "شما این فهرست را درخواست نکردید" ,true) 
	else
	local text = [[
`•• راهنمای مربوط به ارسال متن :`

*> برای قفل کردن متن در گروه :*
• `Lock text`
• `قفل متن`

_○ این دستور برای (حذف) هر متنی که در گروه ارسال  میشود است !_
------------------------------------------
*> برای اخطار دادن متن در گروه :*
• `Warn text`
• `اخطار متن`

_○ این دستور برای (اخطار) به کاربرانی که مورد ارسال شده آنها حاوی متن میباشد است !_
------------------------------------------
*> برای اخطار دادن متن در گروه :*
• `Mute text`
• `سکوت متن`

_○ این دستور برای (سکوت) کردن کاربرانی که مورد ارسال شده آنها حاوی متن میباشد است !_
------------------------------------------
*> برای اخطار دادن متن در گروه :*
• `Kick text`
• `اخراج متن`

_○ این دستور برای (اخراج) کردن کاربرانی که مورد ارسال شده آنها حاوی متن میباشد است !_
------------------------------------------
*> برای آزاد سازی تمامی قفل ها :*
• `UnLock text`
• `باز کردن متن`

_○ این دستور برای بازکردن تمامی قفل هایی  که کاربران رو محدود میکند استفاده میشود !_
	]]
	keyboard = {} 
	keyboard.inline_keyboard = {
		{
			{text= '⇜ بازگشت' ,callback_data = '/helplock:'..mr_roo[2]}
		}
	}
	edit_inline(msg.message_id, text, keyboard)
	end
end
--######################################################################--
if mr_roo[1] == '/lockh17' then
	if not is_mod1(mr_roo[2], msg.from.id) then
     Canswer(msg.cb_id, "شما مدیر نیستید \nبرای خرید ربات به پیوی :\n "..sudo_username.."\nیا به کانال زیر مراجعه کنید :\n "..channel_username.."" ,true)
   elseif not is_req(mr_roo[2], msg.from.id) then 
        Canswer(msg.cb_id, "شما این فهرست را درخواست نکردید" ,true) 
	else
	local text = [[
`•• راهنمای مربوط به ارسال عکس :`

> برای قفل کردن عکس در گروه :
• `Lock photo`
• `قفل عکس`

_○ این دستور برای (حذف) پیام های که در آن ها عکس به کار رفته است استفاده میشود !_
------------------------------------------
*> برای اخطار دادن عکس در گروه :*
• `Warn photo`
• `اخطار عکس`

_○ این دستور برای (اخطار) به کاربرانی که مورد ارسال شده آنها حاوی عکس میباشد است !_
------------------------------------------
*> برای اخطار دادن عکس در گروه :*
• `Mute photo`
• `سکوت عکس`

_○ این دستور برای (سکوت) کردن کاربرانی که مورد ارسال شده آنها حاوی عکس میباشد است !_
------------------------------------------
*> برای اخطار دادن عکس در گروه :*
• `Kick photo`
• `اخراج عکس`

_○ این دستور برای (اخراج) کردن کاربرانی که مورد ارسال شده آنها حاوی عکس میباشد است !_
------------------------------------------
*> برای آزاد سازی تمامی قفل ها :*
• `UnLock photo`
• `باز کردن عکس`

_○ این دستور برای بازکردن تمامی قفل هایی  که کاربران رو محدود میکند استفاده میشود !_
	]]
	keyboard = {} 
	keyboard.inline_keyboard = {
		{
			{text= '⇜ بازگشت' ,callback_data = '/helplock:'..mr_roo[2]}
		}
	}
	edit_inline(msg.message_id, text, keyboard)
	end
end
--######################################################################--
if mr_roo[1] == '/lockh18' then
	if not is_mod1(mr_roo[2], msg.from.id) then
     Canswer(msg.cb_id, "شما مدیر نیستید \nبرای خرید ربات به پیوی :\n "..sudo_username.."\nیا به کانال زیر مراجعه کنید :\n "..channel_username.."" ,true)
   elseif not is_req(mr_roo[2], msg.from.id) then 
        Canswer(msg.cb_id, "شما این فهرست را درخواست نکردید" ,true) 
	else
	local text = [[
`•• راهنمای مربوط به ارسال فیلم :`

*> برای قفل کردن فیلم در گروه :*
• `Lock video`
• `قفل فیلم`

_○ این دستور برای (حذف) پیام های که در آن ها فیلم به کار رفته است استفاده میشود !_
------------------------------------------
*> برای اخطار دادن فیلم در گروه :*
• `Warn video`
• `اخطار فیلم`

_○ این دستور برای (اخطار) به کاربرانی که مورد ارسال شده آنها حاوی فیلم میباشد است !_
------------------------------------------
*> برای اخطار دادن فیلم در گروه :*
• `Mute video`
• `سکوت فیلم`

_○ این دستور برای (سکوت) کردن کاربرانی که مورد ارسال شده آنها حاوی فیلم میباشد است !_
------------------------------------------
*> برای اخطار دادن فیلم در گروه :*
• `Kick video`
• `اخراج فیلم`

_○ این دستور برای (اخراج) کردن کاربرانی که مورد ارسال شده آنها حاوی فیلم میباشد است !_
------------------------------------------
*> برای آزاد سازی تمامی قفل ها :*
• `UnLock video`
• `باز کردن فیلم`

_○ این دستور برای بازکردن تمامی قفل هایی  که کاربران رو محدود میکند استفاده میشود !_
	]]
	keyboard = {} 
	keyboard.inline_keyboard = {
		{
			{text= '⇜ بازگشت' ,callback_data = '/helplock:'..mr_roo[2]}
		}
	}
	edit_inline(msg.message_id, text, keyboard)
	end
end
--######################################################################--
if mr_roo[1] == '/lockh19' then
	if not is_mod1(mr_roo[2], msg.from.id) then
     Canswer(msg.cb_id, "شما مدیر نیستید \nبرای خرید ربات به پیوی :\n "..sudo_username.."\nیا به کانال زیر مراجعه کنید :\n "..channel_username.."" ,true)
   elseif not is_req(mr_roo[2], msg.from.id) then 
        Canswer(msg.cb_id, "شما این فهرست را درخواست نکردید" ,true) 
	else
	local text = [[
`•• راهنمای مربوط به ارسال فیلم سلفی :`

*> برای قفل کردن فیلم سلفی در گروه :*
• `Lock video_note`
• `قفل فیلم سلفی`

_○ این دستور برای (حذف) پیام های که در آن ها فیلم سلفی به کار رفته است استفاده میشود !_
------------------------------------------
*> برای اخطار دادن فیلم سلفی در گروه :*
• `Warn video_note`
• `اخطار فیلم سلفی`

_○ این دستور برای (اخطار) به کاربرانی که مورد ارسال شده آنها حاوی فیلم سلفی میباشد است !_
------------------------------------------
*> برای اخطار دادن فیلم سلفی در گروه :*
• `Mute video_note`
• `سکوت فیلم سلفی`

_○ این دستور برای (سکوت) کردن کاربرانی که مورد ارسال شده آنها حاوی فیلم سلفی میباشد است !_
------------------------------------------
*> برای اخطار دادن فیلم سلفی در گروه :*
• `Kick video_note`
• `اخراج فیلم سلفی`

_○ این دستور برای (اخراج) کردن کاربرانی که مورد ارسال شده آنها حاوی فیلم سلفی میباشد است !_
------------------------------------------
*> برای آزاد سازی تمامی قفل ها :*
• `UnLock video_note`
• `باز کردن فیلم سلفی`

_○ این دستور برای بازکردن تمامی قفل هایی  که کاربران رو محدود میکند استفاده میشود !_
	]]
	keyboard = {} 
	keyboard.inline_keyboard = {
		{
			{text= '⇜ بازگشت' ,callback_data = '/helplock:'..mr_roo[2]}
		}
	}
	edit_inline(msg.message_id, text, keyboard)
	end
end
--######################################################################--
if mr_roo[1] == '/lockh20' then
	if not is_mod1(mr_roo[2], msg.from.id) then
     Canswer(msg.cb_id, "شما مدیر نیستید \nبرای خرید ربات به پیوی :\n "..sudo_username.."\nیا به کانال زیر مراجعه کنید :\n "..channel_username.."" ,true)
   elseif not is_req(mr_roo[2], msg.from.id) then 
        Canswer(msg.cb_id, "شما این فهرست را درخواست نکردید" ,true) 
	else
	local text = [[
`•• راهنمای مربوط به ارسال اهنگ :`

*> برای قفل کردن اهنگ در گروه :*
• `Lock audio`
• `قفل اهنگ`

_○ این دستور برای (حذف) پیام های که در آن ها اهنگ به کار رفته است استفاده میشود !_
------------------------------------------
*> برای اخطار دادن اهنگ در گروه :*
• `Warn audio`
• `اخطار اهنگ`

_○ این دستور برای (اخطار) به کاربرانی که مورد ارسال شده آنها حاوی اهنگ میباشد است !_
------------------------------------------
*> برای اخطار دادن اهنگ در گروه :*
• `Mute audio`
• `سکوت اهنگ`

_○ این دستور برای (سکوت) کردن کاربرانی که مورد ارسال شده آنها حاوی اهنگ میباشد است !_
------------------------------------------
*> برای اخطار دادن اهنگ در گروه :*
• `Kick audio`
• `اخراج اهنگ`

_○ این دستور برای (اخراج) کردن کاربرانی که مورد ارسال شده آنها حاوی اهنگ میباشد است !_
------------------------------------------
*> برای آزاد سازی تمامی قفل ها :*
• `UnLock audio`
• `باز کردن اهنگ`

_○ این دستور برای بازکردن تمامی قفل هایی  که کاربران رو محدود میکند استفاده میشود !_
	]]
	keyboard = {} 
	keyboard.inline_keyboard = {
		{
			{text= '⇜ بازگشت' ,callback_data = '/helplock:'..mr_roo[2]}
		}
	}
	edit_inline(msg.message_id, text, keyboard)
	end
end
--######################################################################--
if mr_roo[1] == '/lockh21' then
	if not is_mod1(mr_roo[2], msg.from.id) then
     Canswer(msg.cb_id, "شما مدیر نیستید \nبرای خرید ربات به پیوی :\n "..sudo_username.."\nیا به کانال زیر مراجعه کنید :\n "..channel_username.."" ,true)
   elseif not is_req(mr_roo[2], msg.from.id) then 
        Canswer(msg.cb_id, "شما این فهرست را درخواست نکردید" ,true) 
	else
	local text = [[
`•• راهنمای مربوط به ارسال صدا :`

*> برای قفل کردن صدا در گروه :*
• `Lock voise`
• `قفل صدا`

_○ این دستور برای (حذف) پیام های که در آن ها صدا به کار رفته است استفاده میشود !_
------------------------------------------
*> برای اخطار دادن صدا در گروه :*
• `Warn voise`
• `اخطار صدا`

_○ این دستور برای (اخطار) به کاربرانی که مورد ارسال شده آنها حاوی صدا میباشد است !_
------------------------------------------
*> برای اخطار دادن صدا در گروه :*
• `Mute voise`
• `سکوت صدا`

_○ این دستور برای (سکوت) کردن کاربرانی که مورد ارسال شده آنها حاوی صدا میباشد است !_
------------------------------------------
*> برای اخطار دادن صدا در گروه :*
• `Kick voise`
• `اخراج صدا`

_○ این دستور برای (اخراج) کردن کاربرانی که مورد ارسال شده آنها حاوی صدا میباشد است !_
------------------------------------------
*> برای آزاد سازی تمامی قفل ها :*
• `UnLock voise`
• `باز کردن صدا`

_○ این دستور برای بازکردن تمامی قفل هایی  که کاربران رو محدود میکند استفاده میشود !_
	]]
	keyboard = {} 
	keyboard.inline_keyboard = {
		{
			{text= '⇜ بازگشت' ,callback_data = '/helplock:'..mr_roo[2]}
		}
	}
	edit_inline(msg.message_id, text, keyboard)
	end
end
--######################################################################--
if mr_roo[1] == '/lockh22' then
	if not is_mod1(mr_roo[2], msg.from.id) then
     Canswer(msg.cb_id, "شما مدیر نیستید \nبرای خرید ربات به پیوی :\n "..sudo_username.."\nیا به کانال زیر مراجعه کنید :\n "..channel_username.."" ,true)
   elseif not is_req(mr_roo[2], msg.from.id) then 
        Canswer(msg.cb_id, "شما این فهرست را درخواست نکردید" ,true) 
	else
	local text = [[
`•• راهنمای مربوط به ارسال استیکر :`

*> برای قفل کردن استیکر در گروه :*
• `Lock sticker`
• `قفل استیکر`

_○ این دستور برای (حذف) پیام های که در آن ها استیکر به کار رفته است استفاده میشود !_
------------------------------------------
*> برای اخطار دادن استیکر در گروه :*
• `Warn sticker`
• `اخطار استیکر`

_○ این دستور برای (اخطار) به کاربرانی که مورد ارسال شده آنها حاوی استیکر میباشد است !_
------------------------------------------
*> برای اخطار دادن استیکر در گروه :*
• `Mute sticker`
• `سکوت استیکر`

_○ این دستور برای (سکوت) کردن کاربرانی که مورد ارسال شده آنها حاوی استیکر میباشد است !_
------------------------------------------
*> برای اخطار دادن استیکر در گروه :*
• `Kick sticker`
• `اخراج استیکر`

_○ این دستور برای (اخراج) کردن کاربرانی که مورد ارسال شده آنها حاوی استیکر میباشد است !_
------------------------------------------
*> برای آزاد سازی تمامی قفل ها :*
• `UnLock sticker`
• `باز کردن استیکر`

_○ این دستور برای بازکردن تمامی قفل هایی  که کاربران رو محدود میکند استفاده میشود !_
	]]
	keyboard = {} 
	keyboard.inline_keyboard = {
		{
			{text= '⇜ بازگشت' ,callback_data = '/helplock:'..mr_roo[2]}
		}
	}
	edit_inline(msg.message_id, text, keyboard)
	end
end
--######################################################################--
if mr_roo[1] == '/lockh23' then
	if not is_mod1(mr_roo[2], msg.from.id) then
     Canswer(msg.cb_id, "شما مدیر نیستید \nبرای خرید ربات به پیوی :\n "..sudo_username.."\nیا به کانال زیر مراجعه کنید :\n "..channel_username.."" ,true)
   elseif not is_req(mr_roo[2], msg.from.id) then 
        Canswer(msg.cb_id, "شما این فهرست را درخواست نکردید" ,true) 
	else
	local text = [[
`•• راهنمای مربوط به ارسال مخاطب :`

*> برای قفل کردن مخاطب در گروه :*
• `Lock contact`
• `قفل مخاطب`

_○ این دستور برای (حذف) پیام های که در آن ها مخاطب به کار رفته است استفاده میشود !_
------------------------------------------
*> برای اخطار دادن مخاطب در گروه :*
• `Warn contact`
• `اخطار مخاطب`

_○ این دستور برای (اخطار) به کاربرانی که مورد ارسال شده آنها حاوی مخاطب میباشد است !_
------------------------------------------
*> برای اخطار دادن مخاطب در گروه :*
• `Mute contact`
• `سکوت مخاطب`

_○ این دستور برای (سکوت) کردن کاربرانی که مورد ارسال شده آنها حاوی مخاطب میباشد است !_
------------------------------------------
*> برای اخطار دادن مخاطب در گروه :*
• `Kick contact`
• `اخراج مخاطب`

_○ این دستور برای (اخراج) کردن کاربرانی که مورد ارسال شده آنها حاوی مخاطب میباشد است !_
------------------------------------------
*> برای آزاد سازی تمامی قفل ها :*
• `UnLock contact`
• `باز کردن مخاطب`

_○ این دستور برای بازکردن تمامی قفل هایی  که کاربران رو محدود میکند استفاده میشود !_
	]]
	keyboard = {} 
	keyboard.inline_keyboard = {
		{
			{text= '⇜ بازگشت' ,callback_data = '/helplock:'..mr_roo[2]}
		}
	}
	edit_inline(msg.message_id, text, keyboard)
	end
end
--######################################################################--
if mr_roo[1] == '/lockh24' then
	if not is_mod1(mr_roo[2], msg.from.id) then
     Canswer(msg.cb_id, "شما مدیر نیستید \nبرای خرید ربات به پیوی :\n "..sudo_username.."\nیا به کانال زیر مراجعه کنید :\n "..channel_username.."" ,true)
   elseif not is_req(mr_roo[2], msg.from.id) then 
        Canswer(msg.cb_id, "شما این فهرست را درخواست نکردید" ,true) 
	else
	local text = [[
`•• راهنمای مربوط به ارسال موقیعت :`

*> برای قفل کردن موقیعت در گروه :*
• `Lock location`
• `قفل موقیعت`

_○ این دستور برای (حذف) پیام های که در آن ها موقیعت به کار رفته است استفاده میشود !_
------------------------------------------
*> برای اخطار دادن موقیعت در گروه :*
• `Warn location`
• `اخطار موقیعت`

_○ این دستور برای (اخطار) به کاربرانی که مورد ارسال شده آنها حاوی موقیعت مکانی میباشد است !_
------------------------------------------
*> برای اخطار دادن موقیعت در گروه :*
• `Mute location`
• `سکوت موقیعت`

_○ این دستور برای (سکوت) کردن کاربرانی که پیام آنها حاوی موقیعت مکانی میباشد است !_
------------------------------------------
*> برای اخطار دادن موقیعت در گروه :*
• `Kick location`
• `اخراج موقیعت`

_○ این دستور برای (اخراج) کردن کاربرانی که مورد ارسال شده آنها حاوی موقیعت مکانی میباشد است !_
------------------------------------------
*> برای آزاد سازی تمامی قفل ها :*
• `UnLock location`
• `باز کردن موقیعت`

_○ این دستور برای بازکردن تمامی قفل هایی  که کاربران رو محدود میکند استفاده میشود !_
	]]
	keyboard = {} 
	keyboard.inline_keyboard = {
		{
			{text= '⇜ بازگشت' ,callback_data = '/helplock:'..mr_roo[2]}
		}
	}
	edit_inline(msg.message_id, text, keyboard)
	end
end
--######################################################################--
if mr_roo[1] == '/lockh25' then
	if not is_mod1(mr_roo[2], msg.from.id) then
     Canswer(msg.cb_id, "شما مدیر نیستید \nبرای خرید ربات به پیوی :\n "..sudo_username.."\nیا به کانال زیر مراجعه کنید :\n "..channel_username.."" ,true)
   elseif not is_req(mr_roo[2], msg.from.id) then 
        Canswer(msg.cb_id, "شما این فهرست را درخواست نکردید" ,true) 
	else
	local text = [[
`•• راهنمای مربوط به ارسال فایل :`

*> برای قفل کردن فایل در گروه :*
• `Lock document`
• `قفل فایل`

_○ این دستور برای (حذف) پیام های  که در آن ها فایل به کار رفته است استفاده میشود !_
------------------------------------------
*> برای اخطار دادن فایل در گروه :*
• `Warn document`
• `اخطار فایل`

_○ این دستور برای (اخطار) به کاربرانی که مورد ارسال شده آنها حاوی فایل میباشد است !_
------------------------------------------
*> برای اخطار دادن فایل در گروه :*
• `Mute document`
• `سکوت فایل`

_○ این دستور برای (سکوت) کردن کاربرانی که مورد ارسال شده آنها حاوی فایل میباشد است !_
------------------------------------------
*> برای اخطار دادن فایل در گروه :*
• `Kick document`
• `اخراج فایل`

_○ این دستور برای (اخراج) کردن کاربرانی که مورد ارسال شده آنها حاوی فایل میباشد است !_
------------------------------------------
*> برای آزاد سازی تمامی قفل ها :*
• `UnLock document`
• `باز کردن فایل`

_○ این دستور برای بازکردن تمامی قفل هایی  که کاربران رو محدود میکند استفاده میشود !_
	]]
	keyboard = {} 
	keyboard.inline_keyboard = {
		{
			{text= '⇜ بازگشت' ,callback_data = '/helplock:'..mr_roo[2]}
		}
	}
	edit_inline(msg.message_id, text, keyboard)
	end
end
--######################################################################--
if mr_roo[1] == '/lockh26' then
	if not is_mod1(mr_roo[2], msg.from.id) then
     Canswer(msg.cb_id, "شما مدیر نیستید \nبرای خرید ربات به پیوی :\n "..sudo_username.."\nیا به کانال زیر مراجعه کنید :\n "..channel_username.."" ,true)
   elseif not is_req(mr_roo[2], msg.from.id) then 
        Canswer(msg.cb_id, "شما این فهرست را درخواست نکردید" ,true) 
	else
	local text = [[
`•• راهنمای مربوط به ارسال سرویس تلگرام :`

*> برای قفل کردن سرویس تلگرام در گروه :*
• `Lock tgservice`
• `قفل سرویس تلگرام`

_○ این دستور برای (حذف) پیام های که در گروه مثل ورود ، خروج ، سنجاق ، افزودن اعضا و..... به کار رفته است !_
------------------------------------------
*> برای آزاد سازی تمامی قفل ها :*
• `UnLock tgservice`
• `باز کردن سرویس تلگرام`

_○ این دستور برای بازکردن تمامی قفل هایی  که کاربران رو محدود میکند استفاده میشود !_
	]]
	keyboard = {} 
	keyboard.inline_keyboard = {
		{
			{text= '⇜ بازگشت' ,callback_data = '/helplock:'..mr_roo[2]}
		}
	}
	edit_inline(msg.message_id, text, keyboard)
	end
end
--######################################################################--
if mr_roo[1] == '/lockh27' then
	if not is_mod1(mr_roo[2], msg.from.id) then
     Canswer(msg.cb_id, "شما مدیر نیستید \nبرای خرید ربات به پیوی :\n "..sudo_username.."\nیا به کانال زیر مراجعه کنید :\n "..channel_username.."" ,true)
   elseif not is_req(mr_roo[2], msg.from.id) then 
        Canswer(msg.cb_id, "شما این فهرست را درخواست نکردید" ,true) 
	else
	local text = [[
`•• راهنمای مربوط به ارسال کیبورد شیشه ای :`

*> برای قفل کردن کیبورد شیشه ای در گروه :*
• `Lock inline`
• `قفل کیبورد شیشه ای`

_○ این دستور برای (حذف) پیام های که در آن ها کیبورد شیشه ای به کار رفته است استفاده میشود !_
------------------------------------------
*> برای اخطار دادن کیبورد شیشه ای در گروه :*
• `Warn inline`
• `اخطار کیبورد شیشه ای`

_○ این دستور برای (اخطار) به کاربرانی که مورد ارسال شده آنها حاوی کیبورد شیشه ای میباشد است !_
------------------------------------------
*> برای اخطار دادن کیبورد شیشه ای در گروه :*
• `Mute inline`
• `سکوت کیبورد شیشه ای`

_○ این دستور برای (سکوت) کردن کاربرانی که مورد ارسال شده آنها حاوی کیبورد شیشه ای میباشد است !_
------------------------------------------
*> برای اخطار دادن کیبورد شیشه ای در گروه :*
• `Kick inline`
• `اخراج کیبورد شیشه ای`

_○ این دستور برای (اخراج) کردن کاربرانی که مورد ارسال شده آنها حاوی کیبورد شیشه ای میباشد است !_
------------------------------------------
*> برای آزاد سازی تمامی قفل ها :*
• `UnLock inline`
• `باز کردن کیبورد شیشه ای`

_○ این دستور برای بازکردن تمامی قفل هایی  که کاربران رو محدود میکند استفاده میشود !_
	]]
	keyboard = {} 
	keyboard.inline_keyboard = {
		{
			{text= '⇜ بازگشت' ,callback_data = '/helplock:'..mr_roo[2]}
		}
	}
	edit_inline(msg.message_id, text, keyboard)
	end
end
--######################################################################--
if mr_roo[1] == '/lockh28' then
	if not is_mod1(mr_roo[2], msg.from.id) then
     Canswer(msg.cb_id, "شما مدیر نیستید \nبرای خرید ربات به پیوی :\n "..sudo_username.."\nیا به کانال زیر مراجعه کنید :\n "..channel_username.."" ,true)
   elseif not is_req(mr_roo[2], msg.from.id) then 
        Canswer(msg.cb_id, "شما این فهرست را درخواست نکردید" ,true) 
	else
	local text = [[
`•• راهنمای مربوط به ارسال بازی :`

*> برای قفل کردن بازی در گروه :*
• `Lock game`
• `قفل بازی`

_○ این دستور برای (حذف) پیام های که در آن ها بازی به کار رفته است استفاده میشود !_
------------------------------------------
*> برای اخطار دادن بازی در گروه :
• `Warn game`
• `اخطار بازی`

_○ این دستور برای (اخطار) به کاربرانی که مورد ارسال شده آنها حاوی بازی میباشد است !_
------------------------------------------
*> برای اخطار دادن بازی در گروه :
• `Mute game`
• `سکوت بازی`

_○ این دستور برای (سکوت) کردن کاربرانی که مورد ارسال شده آنها حاوی بازی میباشد است !_
------------------------------------------
*> برای اخطار دادن بازی در گروه :
• `Kick game`
• `اخراج بازی`

_○ این دستور برای (اخراج) کردن کاربرانی که مورد ارسال شده آنها حاوی بازی میباشد است !_
------------------------------------------
*> برای آزاد سازی تمامی قفل ها :
• `UnLock game`
• `باز کردن بازی`

_○ این دستور برای بازکردن تمامی قفل هایی  که کاربران رو محدود میکند استفاده میشود !_
	]]
	keyboard = {} 
	keyboard.inline_keyboard = {
		{
			{text= '⇜ بازگشت' ,callback_data = '/helplock:'..mr_roo[2]}
		}
	}
	edit_inline(msg.message_id, text, keyboard)
	end
end
--######################################################################--
if mr_roo[1] == '/lockh29' then
	if not is_mod1(mr_roo[2], msg.from.id) then
     Canswer(msg.cb_id, "شما مدیر نیستید \nبرای خرید ربات به پیوی :\n "..sudo_username.."\nیا به کانال زیر مراجعه کنید :\n "..channel_username.."" ,true)
   elseif not is_req(mr_roo[2], msg.from.id) then 
        Canswer(msg.cb_id, "شما این فهرست را درخواست نکردید" ,true) 
	else
	local text = [[
`•• راهنمای مربوط به ارسال صفحه کلید :`

*> برای قفل کردن صفحه کلید در گروه :*
• `Lock keyboard`
• `قفل صفحه کلید`

_○ این دستور برای (حذف) پیام های که در آن ها صفحه کلید به کار رفته است استفاده میشود !_
------------------------------------------
*> برای اخطار دادن صفحه کلید در گروه :*
• `Warn keyboard`
• `اخطار صفحه کلید`

_○ این دستور برای (اخطار) به کاربرانی که مورد ارسال شده آنها حاوی صفحه کلید میباشد است !_
------------------------------------------
*> برای اخطار دادن صفحه کلید در گروه :*
• `Mute keyboard`
• `سکوت صفحه کلید`

_○ این دستور برای (سکوت) کردن کاربرانی که مورد ارسال شده آنها حاوی صفحه کلید میباشد است !_
------------------------------------------
*> برای اخطار دادن صفحه کلید در گروه :*
• `Kick keyboard`
• `اخراج صفحه کلید`

_○ این دستور برای (اخراج) کردن کاربرانی که مورد ارسال شده آنها حاوی صفحه کلید میباشد است !_
------------------------------------------
*> برای آزاد سازی تمامی قفل ها :*
• `UnLock keyboard`
• `باز کردن صفحه کلید`

_○ این دستور برای بازکردن تمامی قفل هایی  که کاربران رو محدود میکند استفاده میشود !_
	]]
	keyboard = {} 
	keyboard.inline_keyboard = {
		{
			{text= '⇜ بازگشت' ,callback_data = '/helplock:'..mr_roo[2]}
		}
	}
	edit_inline(msg.message_id, text, keyboard)
	end
end
--######################################################################--
if mr_roo[1] == '/lockh30' then
	if not is_mod1(mr_roo[2], msg.from.id) then
     Canswer(msg.cb_id, "شما مدیر نیستید \nبرای خرید ربات به پیوی :\n "..sudo_username.."\nیا به کانال زیر مراجعه کنید :\n "..channel_username.."" ,true)
   elseif not is_req(mr_roo[2], msg.from.id) then 
        Canswer(msg.cb_id, "شما این فهرست را درخواست نکردید" ,true) 
	else
	local text = [[
`•• راهنمای مربوط به ارسال بازدید :`

*> برای قفل کردن بازدید در گروه :*
• `Lock viwes`
• `قفل ویو`

_○ این دستور برای (حذف) پیام های که در آن ها بازدید به کار رفته است استفاده میشود !_
------------------------------------------
*> برای اخطار دادن بازدید در گروه :*
• `Warn viwes`
• `اخطار ویو`

_○ این دستور برای (اخطار) به کاربرانی که مورد ارسال شده آنها حاوی بازدید میباشد است !_
------------------------------------------
*> برای اخطار دادن بازدید در گروه :*
• `Mute viwes`
• `سکوت ویو`

_○ این دستور برای (سکوت) کردن کاربرانی که مورد ارسال شده آنها حاوی بازدید میباشد است !_
------------------------------------------
*> برای اخطار دادن بازدید در گروه :*
• `Kick viwes`
• `اخراج ویو`

_○ این دستور برای (اخراج) کردن کاربرانی که مورد ارسال شده آنها حاوی بازدید میباشد است !_
------------------------------------------
*> برای آزاد سازی تمامی قفل ها :*
• `UnLock viwes`
• `باز کردن ویو`

_○ این دستور برای بازکردن تمامی قفل هایی  که کاربران رو محدود میکند استفاده میشود !_
	]]
	keyboard = {} 
	keyboard.inline_keyboard = {
		{
			{text= '⇜ بازگشت' ,callback_data = '/helplock:'..mr_roo[2]}
		}
	}
	edit_inline(msg.message_id, text, keyboard)
	end
end
--######################################################################--
if mr_roo[1] == '/lockh31' then
	if not is_mod1(mr_roo[2], msg.from.id) then
     Canswer(msg.cb_id, "شما مدیر نیستید \nبرای خرید ربات به پیوی :\n "..sudo_username.."\nیا به کانال زیر مراجعه کنید :\n "..channel_username.."" ,true)
   elseif not is_req(mr_roo[2], msg.from.id) then 
        Canswer(msg.cb_id, "شما این فهرست را درخواست نکردید" ,true) 
	else
	local text = [[
`•• راهنمای مربوط به قفل خودکار گروه :`

*> برای قفل کردن خودکار گروه :*
• `Lock auto`
• `قفل خودکار`

_○ این دستور برای قفل خودکار گروه در زمان تایین شده استفاده میشود !_
------------------------------------------
*> برای بازکردن قفل خودکار گروه:*
• `UnLock auto`
• `باز کردن خودکار`

_○ این دستور برای بازکردن قفل خودکار گروه استفاده میشود !_
	]]
	keyboard = {} 
	keyboard.inline_keyboard = {
		{
			{text= '⇜ بازگشت' ,callback_data = '/helplock:'..mr_roo[2]}
		}
	}
	edit_inline(msg.message_id, text, keyboard)
	end
end
--######################################################################--
if mr_roo[1] == '/likehelp' then
      if redis:get(RedisIndex.."IsDisLiked:"..msg.from.id) then
        redis:del(RedisIndex.."IsDisLiked:"..msg.from.id)
        local dislikes = redis:get(RedisIndex.."TiGeRisLikes")
        redis:set(RedisIndex.."TiGeRDisLikes",dislikes - 1)
        redis:set(RedisIndex.."IsLiked:"..msg.from.id,true)
        local likes = redis:get(RedisIndex.."TiGeRLikes")
        redis:set(RedisIndex.."TiGeRLikes",likes + 1)
        Canswer(msg.cb_id, "تشکر فراوان از رای مثبت شما😄❤️" ,true)
      else
        if redis:get(RedisIndex.."IsLiked:"..msg.from.id) then
          redis:del(RedisIndex.."IsLiked:"..msg.from.id)
          local likes = redis:get(RedisIndex.."TiGeRLikes")
          redis:set(RedisIndex.."TiGeRLikes",likes - 1)
          Canswer(msg.cb_id, "خیلی بدی مگه چکار کردم رای مثبت رو پس گرفتی😢💔" ,true)
        else
          redis:set(RedisIndex.."IsLiked:"..msg.from.id,true)
          local likes = redis:get(RedisIndex.."TiGeRLikes")
          redis:set(RedisIndex.."TiGeRLikes",likes + 1)
          Canswer(msg.cb_id, "تشکر فراوان از رای مثبت شما😄❤️" ,true)
        end
      end
	  helplist(msg,mr_roo[2])
end
--######################################################################--
if mr_roo[1] == '/dislikehelp' then
      if redis:get(RedisIndex.."IsLiked:"..msg.from.id) then
        redis:del(RedisIndex.."IsLiked:"..msg.from.id)
        local likes = redis:get(RedisIndex.."TiGeRLikes")
        redis:set(RedisIndex.."TiGeRLikes",likes - 1)
        redis:set(RedisIndex.."IsDisLiked:"..msg.from.id,true)
        local dislikes = redis:get(RedisIndex.."TiGeRDisLikes")
        redis:set(RedisIndex.."TiGeRDisLikes",dislikes + 1)
        Canswer(msg.cb_id, "خیلی بدی مگه چیکار کردم رای منفی دادی 😢💔" ,true)
      else
        if redis:get(RedisIndex.."IsDisLiked:"..msg.from.id) then
          redis:del(RedisIndex.."IsDisLiked:"..msg.from.id)
          local dislikes = redis:get(RedisIndex.."TiGeRDisLikes")
          redis:set(RedisIndex.."TiGeRDisLikes",dislikes - 1)
          Canswer(msg.cb_id, "وای مرسی که رای منفیت رو پس گرفتی 😀🌹" ,true)
        else
          redis:set(RedisIndex.."IsDisLiked:"..msg.from.id,true)
          local dislikes = redis:get(RedisIndex.."TiGeRDisLikes")
          redis:set(RedisIndex.."TiGeRDisLikes",dislikes + 1)
          Canswer(msg.cb_id, "خیلی بدی مگه چیکار کردم رای منفی دادی 😢💔" ,true)
        end
      end
	  helplist(msg,mr_roo[2])
end
--######################################################################--
if mr_roo[1] == '/exithelp' then
	if not is_mod1(mr_roo[2], msg.from.id) then
     Canswer(msg.cb_id, "شما مدیر نیستید \nبرای خرید ربات به پیوی :\n "..sudo_username.."\nیا به کانال زیر مراجعه کنید :\n "..channel_username.."" ,true)
   elseif not is_req(mr_roo[2], msg.from.id) then 
        Canswer(msg.cb_id, "شما این فهرست را درخواست نکردید" ,true) 
	else
		 text = 'ツ لیست راهنمای گروه بسته شده'
		edit_inline(msg.message_id, text)
	end
end
--######################################################################--
if mr_roo[1] == '/exitsudo' then
	if not is_mod1(mr_roo[2], msg.from.id) then
     Canswer(msg.cb_id, "شما مدیر نیستید \nبرای خرید ربات به پیوی :\n "..sudo_username.."\nیا به کانال زیر مراجعه کنید :\n "..channel_username.."" ,true)
   elseif not is_req(mr_roo[2], msg.from.id) then 
        Canswer(msg.cb_id, "شما این فهرست را درخواست نکردید" ,true) 
	else
		 text = 'ツ لیست تنظیمات سودو بسته شده'
		edit_inline(msg.message_id, text)
	end
end
--######################################################################--
end
end

return {
patterns = {"^###cb:(/dislikehelp):(.*)$","^###cb:(/helpsudo1):(.*)$","^###cb:(/autoleave):(.*)$","^###cb:(/markread):(.*)$","^###cb:(/sudolist1):(.*)$","^###cb:(/exitsudo):(.*)$","^###cb:(/helppanelsudo):(.*)$","^###cb:(/infosudo1):(.*)$","^###cb:(/likehelp):(.*)$","^###cb:(/exithelp):(.*)$","^###cb:(/helpclean):(.*)$","^###cb:(/helpfun):(.*)$","^###cb:(/helplist):(.*)$","^###cb:(/helplist2):(.*)$","^###cb:(/helpmod):(.*)$","^###cb:(/helpmod1):(.*)$","^###cb:(/helplock):(.*)$","^###cb:(/lockh1):(.*)$","^###cb:(/lockh2):(.*)$","^###cb:(/lockh3):(.*)$","^###cb:(/lockh4):(.*)$","^###cb:(/lockh5):(.*)$","^###cb:(/lockh6):(.*)$","^###cb:(/lockh7):(.*)$","^###cb:(/lockh8):(.*)$","^###cb:(/lockh9):(.*)$","^###cb:(/lockh10):(.*)$","^###cb:(/lockh11):(.*)$","^###cb:(/lockh12):(.*)$","^###cb:(/lockh13):(.*)$","^###cb:(/lockh14):(.*)$","^###cb:(/lockh15):(.*)$","^###cb:(/lockh16):(.*)$","^###cb:(/lockh17):(.*)$","^###cb:(/lockh18):(.*)$","^###cb:(/lockh19):(.*)$","^###cb:(/lockh20):(.*)$","^###cb:(/lockh21):(.*)$","^###cb:(/lockh22):(.*)$","^###cb:(/lockh23):(.*)$","^###cb:(/lockh24):(.*)$","^###cb:(/lockh25):(.*)$","^###cb:(/lockh26):(.*)$","^###cb:(/lockh27):(.*)$","^###cb:(/lockh28):(.*)$","^###cb:(/lockh29):(.*)$","^###cb:(/lockh30):(.*)$","^###cb:(/lockh31):(.*)$","^###cb:(/helpclean1):(.*)$","^###cb:(/helppn):(.*)$","^###cb:(/helplisti):(.*)$","^###cb:(/helpseti):(.*)$","^###cb:(/helpmah):(.*)$"}, run = TiiGeRTeaM
}
